
&После("ПриЗаписи")
Процедура ЦЗ_ПриЗаписи(Отказ)
	
	ВыпРас = РегистрыСведений.ВыполнениеРассылки.СоздатьМенеджерЗаписи();
	ВыпРас.Объект = Ссылка;
	ВыпРас.Прочитать();
	Если Не ЗначениеЗаполнено(ВыпРас.Объект) Тогда
		ВыпРас.Объект = Ссылка;
		ВыпРас.Записать();
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура ZUPC_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НепроверяемыеРеквизиты = Новый Массив;
	Если ЭтоНовый() Тогда
		НепроверяемыеРеквизиты.Добавить("ZUPC_Locations");
	КонецЕсли;
	Если НепроверяемыеРеквизиты.Количество() > 0 Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
		ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	КонецЕсли;
КонецПроцедуры
