
//&ИзменениеИКонтроль("СоздатьУтверждениеШтатногоРасписания")
//Процедура ЦЗ_СоздатьУтверждениеШтатногоРасписания()

//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Организации.Ссылка КАК Организация
//	|ПОМЕСТИТЬ ВТОрганизации
//	|ИЗ
//	|	Справочник.Организации КАК Организации
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УтверждениеШтатногоРасписания КАК УтверждениеШтатногоРасписания
//	|		ПО Организации.Ссылка = УтверждениеШтатногоРасписания.Организация
//	|			И (УтверждениеШтатногоРасписания.Проведен)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеШтатногоРасписания КАК ИзменениеШтатногоРасписания
//	|		ПО Организации.Ссылка = ИзменениеШтатногоРасписания.Организация
//	|			И (ИзменениеШтатногоРасписания.Проведен)
//	|ГДЕ
//	|	УтверждениеШтатногоРасписания.Ссылка ЕСТЬ NULL
//	|	И ИзменениеШтатногоРасписания.Ссылка ЕСТЬ NULL
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Организации.Организация КАК Организация,
//	|	МИНИМУМ(ЕСТЬNULL(ШтатноеРасписание.ДатаУтверждения, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаУтверждения
//	|ПОМЕСТИТЬ ВТОрганизацииПериоды
//	|ИЗ
//	|	ВТОрганизации КАК Организации
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
//	|		ПО Организации.Организация = ШтатноеРасписание.Владелец
//	|			И (НЕ ШтатноеРасписание.Закрыта)
//	|			И (НЕ ШтатноеРасписание.ГруппаПозицийПодразделения)
//	|			И (ШтатноеРасписание.ДатаУтверждения <> ДАТАВРЕМЯ(1, 1, 1))
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Организации.Организация
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ОрганизацииПериоды.Организация КАК Организация,
//	|	НАЧАЛОПЕРИОДА(ОрганизацииПериоды.ДатаУтверждения, МЕСЯЦ) КАК МесяцВступленияВСилу
//	|ИЗ
//	|	ВТОрганизацииПериоды КАК ОрганизацииПериоды";

//	Выборка = Запрос.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл

//		ДокументУтверждение = Документы.УтверждениеШтатногоРасписания.СоздатьДокумент();
//		ДокументУтверждение.Организация = Выборка.Организация;
//		ДокументУтверждение.Ответственный = Пользователи.ТекущийПользователь();

//		ДокументУтверждение.МесяцВступленияВСилу = Выборка.МесяцВступленияВСилу;

//		ПараметрыВыполнения = Новый Структура("Организация,Подразделение,ДатаВступленияВСилу");
//		ЗаполнитьЗначенияСвойств(ПараметрыВыполнения, ДокументУтверждение);
//		ПараметрыВыполнения.ДатаВступленияВСилу = ТекущаяДатаСеанса();

//		ДокументУтверждение.АвтозаполнениеТекущимиДаннымиШР();

//		ПараметрыВыполнения.Вставить("Позиции", ДокументУтверждение.Позиции.Выгрузить());
//		ПараметрыВыполнения.Вставить("Начисления", ДокументУтверждение.Начисления.Выгрузить());
//		ПараметрыВыполнения.Вставить("Показатели", ДокументУтверждение.Показатели.Выгрузить());
//		ПараметрыВыполнения.Вставить("ЕжегодныеОтпуска", ДокументУтверждение.ЕжегодныеОтпуска.Выгрузить());
//		ПараметрыВыполнения.Вставить("Специальности", ДокументУтверждение.Специальности.Выгрузить());
//		
//		#Удаление
//		ДанныеЗаполнения = РезультатЗаполненияПоТекущейКадровойРасстановке(ПараметрыВыполнения);
//		#КонецУдаления
//		#Вставка
//		Если ПараметрыВыполнения.Организация <> Неопределено  Тогда
//			ДанныеЗаполнения = РезультатЗаполненияПоТекущейКадровойРасстановке(ПараметрыВыполнения);
//		КонецЕсли;
//		#КонецВставки
//				
//		ЗаполнитьДокументПоДаннымЗаполнения(ДокументУтверждение, ДанныеЗаполнения);

//		Запрос = Новый Запрос;
//		Запрос.Текст =
//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	Позиции.Должность КАК Должность,
//		|	Позиции.Подразделение КАК Подразделение
//		|ПОМЕСТИТЬ ВТПозиции
//		|ИЗ
//		|	&Позиции КАК Позиции
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ ПЕРВЫЕ 1
//		|	КадроваяИсторияСотрудников.Период КАК Период
//		|ИЗ
//		|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПозиции КАК Позиции
//		|		ПО КадроваяИсторияСотрудников.Должность = Позиции.Должность
//		|			И КадроваяИсторияСотрудников.Подразделение = Позиции.Подразделение
//		|			И (КадроваяИсторияСотрудников.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.НеподтвержденныеДанные))
//		|ГДЕ
//		|	КадроваяИсторияСотрудников.Организация = &Организация
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	Период";

//		Запрос.УстановитьПараметр("Организация", Выборка.Организация);
//		Запрос.УстановитьПараметр("Позиции", ДокументУтверждение.Позиции);

//		ВыборкаПоРаннимДатам = Запрос.Выполнить().Выбрать();
//		Если ВыборкаПоРаннимДатам.Следующий() Тогда

//			Если Не ЗначениеЗаполнено(ДокументУтверждение.МесяцВступленияВСилу)
//				Или ЗначениеЗаполнено(ВыборкаПоРаннимДатам.Период)
//				И ВыборкаПоРаннимДатам.Период < ДокументУтверждение.МесяцВступленияВСилу Тогда

//				ДокументУтверждение.МесяцВступленияВСилу = НачалоМесяца(ВыборкаПоРаннимДатам.Период);

//			КонецЕсли;

//		КонецЕсли;

//		Если Не ЗначениеЗаполнено(ДокументУтверждение.МесяцВступленияВСилу) Тогда
//			ДокументУтверждение.МесяцВступленияВСилу = НачалоМесяца(ТекущаяДатаСеанса());
//		КонецЕсли;

//		ЗаполнитьПодписантовДокумента(ДокументУтверждение, ДокументУтверждение.МесяцВступленияВСилу);

//		ДокументУтверждение.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
//		ДокументУтверждение.Дата = ДокументУтверждение.МесяцВступленияВСилу;

//		Если ДокументУтверждение.Позиции.Количество() > 0 Тогда
//			ДокументУтверждение.Записать(РежимЗаписиДокумента.Проведение);
//		КонецЕсли;

//	КонецЦикла;

//КонецПроцедуры
