Перем Ответственный;		 
		 
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;    
	
	СписокФизЛицОрганизация = ПолучитьСписокСотрудников();
	
	ТЗНДФЛ = ПолучитьДанныеДляПостроенияОтчета(СписокФизЛицОрганизация);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 10
	//|	Сотрудники.Ссылка КАК Сотрудник
	//|ИЗ
	//|	Справочник.Сотрудники КАК Сотрудники";
	//
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СКДНастроек = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ТекстЗапроса = СКДНастроек.НаборыДанных.НаборДанных1.Запрос;
	
	//Меняем текст запроса так, чтобы первая временная таблица принимала через параметр нашу таблицу значений:
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"ТЗНДФЛ КАК ТЗНДФЛ",
	"&ТЗНДФЛ КАК ТЗНДФЛ");

	Запрос = Новый Запрос;

	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.Текст = ТекстЗапроса;
	//Затем формируем отчет програмным способом, при этом подменяя набор данных — вместо набора запроса подставляем эквивалентный набор данных типа объект:
	Запрос.УстановитьПараметр("ТЗНДФЛ",ТЗНДФЛ);
	
	настройкиСКД = СКДНастроек.ВариантыНастроек.Найти("Основной").Настройки;
	ТабДанных = Запрос.Выполнить().Выгрузить();
	//
	ВнешниеНаборыДанных = Новый Структура;
	//
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ТабДанных);
	//
	//Макет компоновки
	//
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	ВнешнийНД = СКДНастроек.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));  //?

	ИмяНД = СКДНастроек.НаборыДанных[0].Имя;

	ЗаполнитьЗначенияСвойств(ВнешнийНД, СКДНастроек.НаборыДанных.НаборДанных1);
	//
	Для каждого ПолеСКД Из СКДНастроек.НаборыДанных[0].Поля Цикл
		НовоеПоле = ВнешнийНД.Поля.Добавить(ТипЗнч(ПолеСКД));//(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(НовоеПоле,ПолеСКД);
	КонецЦикла;
	//
	СКДНастроек.НаборыДанных.Удалить(СКДНастроек.НаборыДанных[0]);
	СКДНастроек.НаборыДанных[0].Имя = ИмяНД;
	СКДНастроек.НаборыДанных[0].ИмяОбъекта = "ТаблицаДанных";

	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКДНастроек,НастройкиСКД,ДанныеРасшифровки );

	////Компоновка данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных, ДанныеРасшифровки);

	////Вывод результата
//	ДокументРезультат = ЭлементыФормы.Результат;
//	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
//	ДокументРезультат.Показать();	
	
КонецПроцедуры


Функция ПолучитьСписокСотрудников()   
	
	
	МассивТипов = Новый Массив(2);
	МассивТипов[0]= Тип("Null");
	СписокФизЛицОрганизация = Новый ТаблицаЗначений;
	МассивТипов[1]= Тип("СправочникСсылка.ФизическиеЛица");
	СписокФизЛицОрганизация.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов(МассивТипов));
	МассивТипов[1]= Тип("СправочникСсылка.Организации");
	СписокФизЛицОрганизация.Колонки.Добавить("ГоловнаяОрганизация", Новый ОписаниеТипов(МассивТипов));
	СписокФизЛицОрганизация.Колонки.Добавить("Организация", Новый ОписаниеТипов(МассивТипов));
	МассивТипов[1]= Тип("Число");
	СписокФизЛицОрганизация.Колонки.Добавить("Год", Новый ОписаниеТипов(МассивТипов));
	МассивТипов[1]= Тип("Булево");
	СписокФизЛицОрганизация.Колонки.Добавить("НеОтбиратьПоОП", Новый ОписаниеТипов(МассивТипов));


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК Организация,
		|	2024 КАК Год,
		|	ЛОЖЬ КАК НеОтбиратьПоОП
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитььСписокСотрудников()

 
Функция ПолучитьДанныеДляПостроенияОтчета(СписокФизЛицОрганизация)
	
	Период = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "Период").Значение; 
	
	ДатаНачалаНП = Период.ДатаНачала;
	ДатаКонцаНП  = Период.ДатаОкончания;
	ДатаПодписи  = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "ДатаПодписи").Значение;
	Если ТипЗнч(ДатаПодписи) = Тип("СтандартнаяДатаНачала") Тогда 
		ДатаПодписи = ДатаПодписи.Дата;
	КонецЕсли;	
	
	//Если ДатаПодписи = Неопределено Или ДатаПодписи = '00010101' Тогда
		ДатаПодписи = ТекущаяДатаСеанса();
	//КонецЕсли;

	ФизическоеЛицоОтветственного = ?(Ответственный = Неопределено, Справочники.ФизическиеЛица.ПустаяСсылка(), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный.Значение, "ФизическоеЛицо"));
	
	// Создание запроса и установка всех необходимых параметров.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Запрос.УстановитьПараметр("ФизлицоОтветственного", ФизическоеЛицоОтветственного);
	Запрос.УстановитьПараметр("НачалоНП", ДатаНачалаНП);
	Запрос.УстановитьПараметр("КонецНП", ДатаКонцаНП);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаПодписи);
	Запрос.УстановитьПараметр("СписокФизЛицОрганизация", СписокФизЛицОрганизация);
	Запрос.УстановитьПараметр("Резидент", Справочники.СтатусыНалогоплательщиковПоНДФЛ.Резидент);
	Запрос.УстановитьПараметр("Нерезидент", Справочники.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент);
	Запрос.УстановитьПараметр("ДатаИзмененияНалогообложенияДивидендов", УчетНДФЛ.ДатаИзмененияНалогообложенияДивидендов());
	Запрос.УстановитьПараметр("ДатаНачалаРасчетаСроковУплатыНалога", УчетНДФЛ.ДатаНачалаРасчетаСроковУплатыНалога());
	Запрос.УстановитьПараметр("ДатаЗакона263ФЗ", УчетНДФЛ.ДатаЗакона263ФЗ());
	Запрос.УстановитьПараметр("ДатаЗакона285ФЗ", УчетНДФЛ.ДатаЗакона285ФЗ());
	Запрос.УстановитьПараметр("ГодЗакона285ФЗ", Год(УчетНДФЛ.ДатаЗакона285ФЗ()));
	ПараметрыРасчетаНДФЛПоПрогрессивнойШкале = УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале();		
	Запрос.УстановитьПараметр("ДатаОбъединенияНалоговыхБаз", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.ДатаОбъединенияНалоговыхБаз);
	Запрос.УстановитьПараметр("НачалоРасчетаНДФЛПоПрогрессивнойШкале", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.НачалоРасчетаНДФЛПоПрогрессивнойШкале);
	Запрос.УстановитьПараметр("ГодНачалаРасчетаНДФЛПоПрогрессивнойШкале", Год(ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.НачалоРасчетаНДФЛПоПрогрессивнойШкале));
	Запрос.УстановитьПараметр("ОсновнаяНалоговаяБаза", Перечисления.КатегорииДоходовНДФЛ.ОсновнаяНалоговаяБаза());
	Запрос.УстановитьПараметр("ОбщаяНалоговаяБаза", Перечисления.КатегорииДоходовНДФЛ.ПоОсновнойСтавке());
	Запрос.УстановитьПараметр("ДоходыОтТрудовойДеятельности", Перечисления.КатегорииДоходовНДФЛ.ДоходыОтТрудовойДеятельности());
	Запрос.УстановитьПараметр("Предел", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел);
	Запрос.УстановитьПараметр("СтавкаСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Ставка);
	Запрос.УстановитьПараметр("СтавкаЧисломСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.СтавкаЧислом);
	// Сформируем текст запроса с датами месяцев налогового периода.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(Запрос.МенеджерВременныхТаблиц, ДатаНачалаНП, ДатаКонцаНП,,,, Истина);
	
	// -----------------------------------------------------------------------------
	// ВЫБОРКА СВЕДЕНИЙ ОБ ОРГАНИЗАЦИИ И ФИЗЛИЦЕ (Данные разделов 1 и 2).
	// 	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизЛицаОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ФизЛицаОрганизация.Организация,
	|	ФизЛицаОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ФизЛицаОрганизация.Год КАК Год,
	|	ФизЛицаОрганизация.НеОтбиратьПоОП
	|ПОМЕСТИТЬ ВТСписокФизЛицОрганизация
	|ИЗ
	|	&СписокФизЛицОрганизация КАК ФизЛицаОрганизация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	ГоловнаяОрганизация,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСписокФизЛицОрганизация.ФизическоеЛицо,
	|	&ДатаАктуальности КАК Период
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация КАК СтруктурнаяЕдиница,
	|	&ДатаАктуальности КАК Период
	|ПОМЕСТИТЬ ВТГоловныеОрганизации
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	ВТСписокФизЛицОрганизация.ФизическоеЛицо,
	|	ВТСписокФизЛицОрганизация.Год,
	|	ВЫБОР
	|		КОГДА Организации.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТСписокФизЛицОрганизация.Организация
	|		ИНАЧЕ Организации.Ссылка
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТОбособленныеПодразделения
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВТСписокФизЛицОрганизация.ГоловнаяОрганизация = Организации.ГоловнаяОрганизация
	|			И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	ВТСписокФизЛицОрганизация.ФизическоеЛицо,
	|	ВТСписокФизЛицОрганизация.Год,
	|	ВТСписокФизЛицОрганизация.Организация
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Периоды.Период) КАК Период,
	|	СписокФизЛицОрганизация.Год КАК Год,
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТТаблицаДляСрезаНаКонецГода
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.Год,
	|	СписокФизЛицОрганизация.ФизическоеЛицо";
	
	Запрос.Выполнить();
	
	МассивНеобходимыхДанных = Новый Массив;
	МассивНеобходимыхДанных.Добавить("ФИОПолные");
	МассивНеобходимыхДанных.Добавить("ДокументВид");
	МассивНеобходимыхДанных.Добавить("ДокументНомер");
	МассивНеобходимыхДанных.Добавить("ДокументСерия");
	МассивНеобходимыхДанных.Добавить("АдресПоПрописке");
	МассивНеобходимыхДанных.Добавить("АдресЗаПределамиРФ");
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(
		Запрос.МенеджерВременныхТаблиц,
		"ВТФизическиеЛица");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Ложь, МассивНеобходимыхДанных);
	
	// Получим кадровые данные ответственного лица.
	ФизическоеЛицоОтветственногоВМассиве = Новый Массив;
	ФизическоеЛицоОтветственногоВМассиве.Добавить(ФизическоеЛицоОтветственного);
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудниковОрганизаций.СписокФизическихЛиц 	= ФизическоеЛицоОтветственногоВМассиве;
	ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода 			= ДатаПодписи;
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода 		= ДатаПодписи;
	ПараметрыПолученияСотрудниковОрганизаций.КадровыеДанные			= "ВидЗанятости,Организация,Должность";
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудниковОрганизаций);
	КадровыйУчет.СоздатьВТСтраныМираДляГражданства(Запрос.МенеджерВременныхТаблиц);
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.Вставить("ВсеЗаписи", Истина);
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ГражданствоФизическихЛиц",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТТаблицаДляСрезаНаКонецГода",
			"Период,ФизическоеЛицо"),
		ПараметрыПостроения);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ИсторияРегистрацийВНалоговомОргане",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТГоловныеОрганизации",
			"Период,СтруктурнаяЕдиница"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГОД(ГражданствоФизЛицаСрезПоследних.Период) КАК Год,
	|	ГражданствоФизЛицаСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтраныМира.Код КАК КодСтраны,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛицаСрезПоследних.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)) = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА """"
	|		ИНАЧЕ ГражданствоФизЛицаСрезПоследних.ИНН
	|	КОНЕЦ КАК ИННВСтранеГражданства
	|ПОМЕСТИТЬ ВТГражданствоФизЛиц
	|ИЗ
	|	ВТГражданствоФизическихЛицСрезПоследних КАК ГражданствоФизЛицаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтраныМираДляГражданства КАК СтраныМира
	|		ПО ГражданствоФизЛицаСрезПоследних.Страна = СтраныМира.Страна
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Периоды.Период КАК Период,
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Периоды.Период) КАК Период,
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТИзмеренияДатыДляВТСтатусыФизЛицНаКонецНалоговогоПериода
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.Год,
	|	СписокФизЛицОрганизация.ФизическоеЛицо";
	
	Запрос.Выполнить();
	
	// Статусы застрахованных на конец месяца.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"СтатусФизическихЛицКакНалогоплательщиковНДФЛ",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца",
			"ФизическоеЛицо"),
		,
		"ВТСтатусФизЛицНаКонецМесяцаПромежуточная");
		
	// Статусы застрахованных на конец налогового периода.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"СтатусФизическихЛицКакНалогоплательщиковНДФЛ",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТИзмеренияДатыДляВТСтатусыФизЛицНаКонецНалоговогоПериода",
			"ФизическоеЛицо"),
		,
		"ВТСтатусыФизЛицНаКонецНалоговогоПериодаПромежуточная");
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период, МЕСЯЦ) КАК Месяц,
	|	ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период < &ДатаИзмененияНалогообложенияДивидендов
	|				ТОГДА СтатусФизЛицНаКонецМесяца.Статус.КодФНС
	|			ИНАЧЕ СтатусФизЛицНаКонецМесяца.Статус.КодФНС_2015
	|		КОНЕЦ, 1) КАК Статус,
	|	ВЫБОР
	|		КОГДА ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период < &ДатаЗакона285ФЗ
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(СтатусФизЛицНаКонецМесяца.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) В (ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент), ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы))
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(СтатусФизЛицНаКонецМесяца.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЯвляетсяРезидентомРФ,
	|	ВЫБОР
	|		КОГДА ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период < &ДатаЗакона285ФЗ
	|				И СтатусФизЛицНаКонецМесяца.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|		ИНАЧЕ ЕСТЬNULL(СтатусФизЛицНаКонецМесяца.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	|	КОНЕЦ КАК ТекущийСтатус
	|ПОМЕСТИТЬ ВТСтатусФизЛицНаКонецМесяца
	|ИЗ
	|	ВТИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца КАК ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусФизЛицНаКонецМесяцаПромежуточная КАК СтатусФизЛицНаКонецМесяца
	|		ПО ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период = СтатусФизЛицНаКонецМесяца.Период
	|			И ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.ФизическоеЛицо = СтатусФизЛицНаКонецМесяца.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокФизЛицОрганизация.ГОД КАК Год,
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА СписокФизЛицОрганизация.ГОД < &ГодЗакона285ФЗ
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(СтатусыФизЛицНаКонецНалоговогоПериода.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) В (ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент), ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы))
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(СтатусыФизЛицНаКонецНалоговогоПериода.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЯвляетсяРезидентомРФ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СтатусыФизЛицНаКонецНалоговогоПериода.Статус, &Резидент) <> &Резидент
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИспользоватьИностранныйАдрес,
	|	ВЫБОР
	|		КОГДА СписокФизЛицОрганизация.ГОД < &ГодЗакона285ФЗ
	|				И СтатусыФизЛицНаКонецНалоговогоПериода.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|		ИНАЧЕ ЕСТЬNULL(СтатусыФизЛицНаКонецНалоговогоПериода.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	|	КОНЕЦ КАК Статус
	|ПОМЕСТИТЬ ВТСтатусыФизЛицНаКонецНалоговогоПериода
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериодаПромежуточная КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|		ПО (СписокФизЛицОрганизация.ГОД = ГОД(СтатусыФизЛицНаКонецНалоговогоПериода.Период))
	|			И СписокФизЛицОрганизация.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусФизЛицНаКонецМесяца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ ВТИзмеренияДатыДляВТПрименениеСтандартныхВычетовПоНДФЛСрезПоследних
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусФизЛицНаКонецМесяца.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ)";
	
	Запрос.Выполнить();

	// Статусы застрахованных на конец налогового периода.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ПрименениеСтандартныхВычетовПоНДФЛ",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТИзмеренияДатыДляВТПрименениеСтандартныхВычетовПоНДФЛСрезПоследних",
			"ФизическоеЛицо"));
			
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусФизЛицНаКонецМесяца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) КАК Период,
	|	НДФЛПрименениеВычетов.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|ПОМЕСТИТЬ ВТПрименениеВычетовВМесяцаРезидентства
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|		ПО (ГОД(СтатусФизЛицНаКонецМесяца.Месяц) = СтатусыФизЛицНаКонецНалоговогоПериода.Год)
	|			И СтатусФизЛицНаКонецМесяца.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрименениеСтандартныхВычетовПоНДФЛСрезПоследних КАК НДФЛПрименениеВычетов
	|		ПО (НДФЛПрименениеВычетов.ФизическоеЛицо = СтатусФизЛицНаКонецМесяца.ФизическоеЛицо)
	|			И (НДФЛПрименениеВычетов.Период = СтатусФизЛицНаКонецМесяца.Месяц)
	|ГДЕ
	|	СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Период,
	|	ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ДатаАктуальности КАК Период,
	|	ФизЛица.ГоловнаяОрганизация.ИндивидуальныйПредприниматель КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТФизическиеЛицаДляПолученияФИО
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ФизЛица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ДатаАктуальности,
	|	&ФизлицоОтветственного";
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("ОбъединеннаяНалоговаяБазаСтрокой", НСтр("ru = 'Объединенная налоговая база'"));
	Запрос.УстановитьПараметр("ОсновнаяНалоговаяБазаСтрокой", НСтр("ru = 'Основная налоговая база'"));
	Запрос.УстановитьПараметр("Дивиденды", НСтр("ru = 'Дивиденды'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыОтДолевогоУчастия", НСтр("ru = 'Доходы от долевого участия'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыПоВыигрышам", НСтр("ru = 'Доходы по выигрышам'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыЦБ", НСтр("ru = 'Операции с ценными бумагами кроме процента, купона по облигациям российских организаций'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыРЕПО", НСтр("ru = 'Операции РЕПО'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыЗаймЦБ", НСтр("ru = 'Операции займа ценными бумагами'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыИИС", НСтр("ru = 'Операции на ИИС'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыПоОблигациям", НСтр("ru = 'Процент, купон по облигациям российских организаций с 1 января 2017 г.'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ", НСтр("ru = 'Прочие доходы, облагаемые по ставке п. 1.1 ст. 224 НК РФ'"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) КАК КатегорияДохода,
	|	&ОсновнаяНалоговаяБазаСтрокой КАК ПредставлениеНалоговойБазы,
	|	1 КАК ПорядокНалоговойБазы
	|ПОМЕСТИТЬ ВТОписаниеНалоговыхБаз
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды),
	|	&Дивиденды,
	|	90
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке03),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке05),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке06),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке07),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке10),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке15),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыОтДолевогоУчастия),
	|	&ПрочиеДоходыОтДолевогоУчастия,
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоВыигрышам),
	|	&ПрочиеДоходыПоВыигрышам,
	|	3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЦБ),
	|	&ПрочиеДоходыЦБ,
	|	4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыРЕПО),
	|	&ПрочиеДоходыРЕПО,
	|	5
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЗаймЦБ),
	|	&ПрочиеДоходыЗаймЦБ,
	|	6
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыИИС),
	|	&ПрочиеДоходыИИС,
	|	7
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоОблигациям),
	|	&ПрочиеДоходыПоОблигациям,
	|	8
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ),
	|	&ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ,
	|	9";
	Запрос.Выполнить();

	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТФизическиеЛицаДляПолученияФИО");
	ОписательВременныхТаблиц.ИмяВТКадровыеДанныеФизическихЛиц = "ВТФИООтветственных";
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, "ФИОПолные,ИОФамилия");

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СписокФизЛицОрганизация.Год КАК Год,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация.ИНН КАК Организация_ИНН,
	|	ИсторияРегистрацийВНалоговомОргане.РегистрацияВНалоговомОргане.КПП КАК Организация_КПП,
	|	ИсторияРегистрацийВНалоговомОргане.РегистрацияВНалоговомОргане.Код КАК Организация_КодНалоговогоОргана,
	|	ВЫБОР
	|		КОГДА СписокФизЛицОрганизация.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
	|			ТОГДА СписокФизЛицОрганизация.ГоловнаяОрганизация.НаименованиеПолное
	|		ИНАЧЕ ФИОПредпринимателя.ФИОПолные
	|	КОНЕЦ КАК Организация_Наименование,
	|	ДанныеОФизЛице.ИНН КАК ФизическоеЛицо_ИНН,
	|	КадровыеДанныеФизЛиц.ФИОПолные КАК ФизическоеЛицо_ФИО,
	|	ФИОФизлицаОтветственного.ИОФамилия КАК Ответственный_ФИО,
	|	ДолжностьОтветственного.Должность.Наименование КАК Ответственный_Должность,
	|	КадровыеДанныеФизЛиц.ДокументВид.Наименование КАК ВидДокумента,
	|	ВЫБОР
	|		КОГДА КадровыеДанныеФизЛиц.ДокументВид ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ КадровыеДанныеФизЛиц.ДокументВид.КодМВД
	|	КОНЕЦ КАК КодДокументаУдЛичн,
	|	ВЫБОР
	|		КОГДА КадровыеДанныеФизЛиц.ДокументВид ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ КадровыеДанныеФизЛиц.ДокументСерия + "" "" + КадровыеДанныеФизЛиц.ДокументНомер
	|	КОНЕЦ КАК ФизическоеЛицо_СерияНомерДокументаУдЛичн,
	|	ДанныеОФизЛице.ДатаРождения КАК ФизическоеЛицо_ДатаРождения,
	|	ЕСТЬNULL(ГражданствоФизЛица.КодСтраны, ""643"") КАК ФизическоеЛицо_КодСтраны,
	|	ДоходыПредыдущегоМестаРаботыНДФЛ.Размер КАК ФизическоеЛицо_ДоходыПредыдущегоМестаРаботы,
	|	ЕСТЬNULL(КадровыеДанныеФизЛиц.АдресПоПрописке, """") КАК АдресРегистрации,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ИспользоватьИностранныйАдрес
	|			ТОГДА ЕСТЬNULL(ГражданствоФизЛица.КодСтраны, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФизическоеЛицо_АдресКодСтраны,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ИспользоватьИностранныйАдрес
	|			ТОГДА ЕСТЬNULL(КадровыеДанныеФизЛиц.АдресЗаПределамиРФ, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФизическоеЛицо_ИностранныйАдрес
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственных КАК ФИОПредпринимателя
	|		ПО (ФИОПредпринимателя.ФизическоеЛицо = СписокФизЛицОрганизация.ГоловнаяОрганизация.ИндивидуальныйПредприниматель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ДанныеОФизЛице
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = ДанныеОФизЛице.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ДанныеОбОтветственном
	|		ПО (ДанныеОбОтветственном.Ссылка = &ФизлицоОтветственного)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизЛиц
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = КадровыеДанныеФизЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсторияРегистрацийВНалоговомОрганеСрезПоследних КАК ИсторияРегистрацийВНалоговомОргане
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = ИсторияРегистрацийВНалоговомОргане.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственных КАК ФИОФизлицаОтветственного
	|		ПО (ФИОФизлицаОтветственного.ФизическоеЛицо = &ФизлицоОтветственного)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданствоФизЛиц КАК ГражданствоФизЛица
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = ГражданствоФизЛица.ФизическоеЛицо
	|			И СписокФизЛицОрганизация.Год = ГражданствоФизЛица.Год
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоходыПредыдущегоМестаРаботыНДФЛ КАК ДоходыПредыдущегоМестаРаботыНДФЛ
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = ДоходыПредыдущегоМестаРаботыНДФЛ.ФизическоеЛицо
	|			И СписокФизЛицОрганизация.ГоловнаяОрганизация = ДоходыПредыдущегоМестаРаботыНДФЛ.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.Год = ГОД(ДоходыПредыдущегоМестаРаботыНДФЛ.МесяцНалоговогоПериода))
	|			И (МЕСЯЦ(ДоходыПредыдущегоМестаРаботыНДФЛ.МесяцНалоговогоПериода) = 12)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК ДолжностьОтветственного
	|		ПО (ДолжностьОтветственного.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство))
	|			И (ДолжностьОтветственного.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	Год";
	
	ДанныеОФизЛицеОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	УчетНДФЛ.СоздатьВТСтандартныеВычетыПоНДФЛЗаПериод(Запрос.МенеджерВременныхТаблиц, Ложь, ДатаПодписи, "ВТПрименениеВычетовВМесяцаРезидентства");
	УчетНДФЛ.СоздатьВТДополнительныеСвойстваКодаДохода(Запрос.МенеджерВременныхТаблиц);
	
	// АПК:96-выкл в таблице ВТСтрокиУчета строки должны быть уникальны
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДФЛСведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НДФЛСведенияОДоходах.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НДФЛСведенияОДоходах.СуммаДохода КАК СуммаДохода,
	|	НДФЛСведенияОДоходах.КодДохода КАК КодДохода,
	|	НДФЛСведенияОДоходах.КатегорияДохода КАК КатегорияДохода,
	|	НДФЛСведенияОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	НДФЛСведенияОДоходах.Период КАК Период,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.ДатаПолученияДохода >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|				И НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|			ТОГДА 0
	|		ИНАЧЕ НДФЛСведенияОДоходах.СуммаВычета
	|	КОНЕЦ КАК СуммаВычета,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.ДатаПолученияДохода >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|				И НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
	|		ИНАЧЕ НДФЛСведенияОДоходах.КодВычета
	|	КОНЕЦ КАК КодВычета,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода КАК ПериодДляОпределенияСтатуса,
	|	НДФЛСведенияОДоходах.КодДохода.Код КАК КодДоходаКод,
	|	НДФЛСведенияОДоходах.МесяцНалоговогоПериода < &ДатаЗакона263ФЗ
	|		И СвойстваКодаДохода.СоответствуетОплатеТруда
	|		И (НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|			ИЛИ НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций)) КАК УчитываетсяПоМесяцуНачисления,
	|	НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2021, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		ИНАЧЕ НДФЛСведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2021Года
	|	КОНЕЦ КАК КодДоходаКодДляОтчетности,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ КАК КодВычетаКодДляОтчетности,
	|	НДФЛСведенияОДоходах.КодВычета.НеПредоставляетсяНерезидентам КАК ВычетНеПредоставляетсяНерезидентам,
	|	НДФЛСведенияОДоходах.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ,
	|	&УсловиеОблагаемостиУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
	|	НДФЛСведенияОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
	|	НДФЛСведенияОДоходах.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТСтрокиДоходов
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахНДФЛ КАК НДФЛСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДополнительныеСвойстваКодаДохода КАК СвойстваКодаДохода
	|		ПО НДФЛСведенияОДоходах.КодДохода = СвойстваКодаДохода.КодДохода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО НДФЛСведенияОДоходах.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И НДФЛСведенияОДоходах.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ НДФЛСведенияОДоходах.Организация = СписокФизЛицОрганизация.Организация)
	|ГДЕ
	|	НДФЛСведенияОДоходах.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.ВидДвижения КАК ВидДвижения,
	|	НДФЛРасчетыСБюджетом.Сумма КАК Сумма,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышения КАК СуммаСПревышения,
	|	НДФЛРасчетыСБюджетом.ВариантУдержания КАК ВариантУдержания,
	|	НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	НДФЛРасчетыСБюджетом.Период КАК Период,
	|	НДФЛРасчетыСБюджетом.КатегорияДохода КАК КатегорияДохода,
	|	НДФЛРасчетыСБюджетом.КодДохода КАК КодДохода,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК ПериодДляОпределенияСтатуса,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НДФЛРасчетыСБюджетом.КрайнийСрокУплаты КАК СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.СуммаВыплаченногоДохода КАК СуммаВыплаченногоДохода,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КатегорияДохода В (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды))
	|			ТОГДА НДФЛРасчетыСБюджетом.НалогСДивидендовУплаченныйЗаРубежом
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|			ТОГДА НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогНаПрибыльДляДивидендов
	|ПОМЕСТИТЬ ВТСтрокиНалогов
	|ИЗ
	|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК НДФЛРасчетыСБюджетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И (ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) = СписокФизЛицОрганизация.Год)
	|			И НДФЛРасчетыСБюджетом.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ НДФЛРасчетыСБюджетом.Организация = СписокФизЛицОрганизация.Организация)
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ВидДвижения КАК ВидДвижения,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.Сумма КАК Сумма,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.Период КАК Период,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.КодДохода КАК КодДохода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.МесяцНалоговогоПериода КАК ПериодДляОпределенияСтатуса,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.КатегорияДохода КАК КатегорияДохода
	|ПОМЕСТИТЬ ВТСтрокиАвансов
	|ИЗ
	|	ВТСтрокиНалогов КАК АвансовыеПлатежиИностранцевПоНДФЛ
	|ГДЕ
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиДоходов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтрокиДоходов.ПериодДляОпределенияСтатуса КАК Период,
	|	СтрокиДоходов.КодДохода КАК КодДохода,
	|	СтрокиДоходов.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	СтрокиДоходов.КатегорияДохода КАК КатегорияДохода
	|ПОМЕСТИТЬ ВТСтрокиУчета
	|ИЗ
	|	ВТСтрокиДоходов КАК СтрокиДоходов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиНалогов.ФизическоеЛицо,
	|	СтрокиНалогов.ПериодДляОпределенияСтатуса,
	|	СтрокиНалогов.КодДохода,
	|	СтрокиНалогов.СтавкаНалогообложенияРезидента,
	|	СтрокиНалогов.КатегорияДохода
	|ИЗ
	|	ВТСтрокиНалогов КАК СтрокиНалогов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиНалогов.ФизическоеЛицо,
	|	КОНЕЦПЕРИОДА(СтрокиНалогов.ПериодДляОпределенияСтатуса, ГОД),
	|	СтрокиНалогов.КодДохода,
	|	СтрокиНалогов.СтавкаНалогообложенияРезидента,
	|	СтрокиНалогов.КатегорияДохода
	|ИЗ
	|	ВТСтрокиНалогов КАК СтрокиНалогов";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОблагаемостиУНалоговогоАгента", УчетНДФЛ.УсловиеОблагаемостиУНалоговогоАгента("НДФЛСведенияОДоходах"));
	Запрос.Выполнить();
	// АПК:96-вкл
	
	УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТСтрокиУчета",,,"ВТСтавкаНДФЛ");
	УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента2016(Запрос.МенеджерВременныхТаблиц, "ВТСтрокиУчета");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтандартныеВычетыПоНДФЛЗаПериод.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтандартныеВычетыПоНДФЛЗаПериод.Месяц КАК Месяц,
	|	СтандартныеВычетыПоНДФЛЗаПериод.КодВычета КАК КодВычетаЛичный,
	|	СтандартныеВычетыПоНДФЛЗаПериод.Количество КАК КоличествоДетей,
	|	СтандартныеВычетыПоНДФЛЗаПериод.Основание КАК Основание
	|ПОМЕСТИТЬ ВТСтандартныеВычетыПоМесяцамРезидентства
	|ИЗ
	|	ВТСтандартныеВычетыПоНДФЛЗаПериод КАК СтандартныеВычетыПоНДФЛЗаПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрименениеВычетовВМесяцаРезидентства.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрименениеВычетовВМесяцаРезидентства.Период КАК Месяц,
	|	ПрименениеВычетовВМесяцаРезидентства.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СтандартныеВычетыПоМесяцамРезидентства.КодВычетаЛичный КАК КодВычета,
	|	СтандартныеВычетыПоМесяцамРезидентства.КоличествоДетей КАК КоличествоДетей,
	|	СтандартныеВычетыПоМесяцамРезидентства.Основание КАК Основание
	|ПОМЕСТИТЬ ВТСтандартныеВычетыФизЛицОрганизации
	|ИЗ
	|	ВТПрименениеВычетовВМесяцаРезидентства КАК ПрименениеВычетовВМесяцаРезидентства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтандартныеВычетыПоМесяцамРезидентства КАК СтандартныеВычетыПоМесяцамРезидентства
	|		ПО ПрименениеВычетовВМесяцаРезидентства.ФизическоеЛицо = СтандартныеВычетыПоМесяцамРезидентства.ФизическоеЛицо
	|			И ПрименениеВычетовВМесяцаРезидентства.Период = СтандартныеВычетыПоМесяцамРезидентства.Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычета КАК КодВычета,
	|	СУММА(НДФЛИмущественныеВычетыФизлиц.Сумма) КАК Размер,
	|	МАКСИМУМ(НДФЛИмущественныеВычетыФизлиц.Регистратор) КАК Регистратор,
	|	НДФЛИмущественныеВычетыФизлиц.Период КАК Дата
	|ПОМЕСТИТЬ ВТСоциальныеИИмущественныеВычеты
	|ИЗ
	|	РегистрНакопления.ИмущественныеВычетыНДФЛ КАК НДФЛИмущественныеВычетыФизлиц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ НДФЛИмущественныеВычетыФизлиц.Организация = СписокФизЛицОрганизация.Организация)
	|			И (НДФЛИмущественныеВычетыФизлиц.Год = ГОД(&НачалоНП))
	|			И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.ФизическоеЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычета,
	|	НДФЛИмущественныеВычетыФизлиц.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокФизЛицОрганизация.ФизическоеЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	СУММА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Сумма),
	|	НЕОПРЕДЕЛЕНО,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Период
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК НДФЛПредоставленныеСтандартныеВычетыФизЛиц
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ГоловнаяОрганизация
	|			И СписокФизЛицОрганизация.ФизическоеЛицо = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ СписокФизЛицОрганизация.Организация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация)
	|			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.ГруппаВычета = ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.Социальные))
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	СписокФизЛицОрганизация.ФизическоеЛицо,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛСведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ГОД(НДФЛСведенияОДоходах.МесяцНалоговогоПериода) КАК Год,
	|	НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.МесяцНалоговогоПериода, МЕСЯЦ) КАК Месяц,
	|	НДФЛСведенияОДоходах.СуммаДохода КАК СуммаДохода,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицПоГодам.Статус = &Резидент
	|			ТОГДА НДФЛСведенияОДоходах.СуммаВычета
	|		КОГДА НДФЛСведенияОДоходах.ВычетНеПредоставляетсяНерезидентам
	|			ТОГДА 0
	|		ИНАЧЕ НДФЛСведенияОДоходах.СуммаВычета
	|	КОНЕЦ КАК СуммаВычета,
	|	НДФЛСведенияОДоходах.КодДохода КАК КодДохода,
	|	НДФЛСведенияОДоходах.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
	|	НДФЛСведенияОДоходах.КодДоходаКод КАК КодДоходаКод,
	|	НДФЛСведенияОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
	|	ВЫБОР
	|		КОГДА ГОД(НДФЛСведенияОДоходах.МесяцНалоговогоПериода) < 2017
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ
	|		ИНАЧЕ СтавкиНДФЛ.СтавкаНДФЛ
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА ГОД(НДФЛСведенияОДоходах.МесяцНалоговогоПериода) < 2017
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом
	|		ИНАЧЕ СтавкиНДФЛ.СтавкаЧислом
	|	КОНЕЦ КАК СтавкаЧислом,
	|	НДФЛСведенияОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.УчитываетсяПоМесяцуНачисления
	|			ТОГДА НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.МесяцНалоговогоПериода, МЕСЯЦ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК МесяцНачисления,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.УчитываетсяПоМесяцуНачисления
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ НДФЛСведенияОДоходах.ДатаПолученияДохода
	|	КОНЕЦ КАК ДатаВыплаты,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода КАК Период,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	НДФЛСведенияОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
	|	НДФЛСведенияОДоходах.Период КАК ДатаНачисления,
	|	НДФЛСведенияОДоходах.КодВычета КАК КодВычета,
	|	НДФЛСведенияОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
	|	ВЫБОР
	|		КОГДА СтавкиНДФЛ.СтавкаНДФЛ <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		КОГДА НДФЛСведенияОДоходах.ДатаПолученияДохода < &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		КОГДА НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		КОГДА НДФЛСведенияОДоходах.КатегорияДохода В (&ОсновнаяНалоговаяБаза)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		КОГДА НДФЛСведенияОДоходах.КатегорияДохода В (&ОбщаяНалоговаяБаза)
	|				И НДФЛСведенияОДоходах.ДатаПолученияДохода >= &ДатаОбъединенияНалоговыхБаз
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		ИНАЧЕ НДФЛСведенияОДоходах.КатегорияДохода
	|	КОНЕЦ КАК НалоговаяБаза,
	|	НДФЛСведенияОДоходах.КатегорияДохода КАК КатегорияДохода,
	|	ВЫБОР
	|		КОГДА ГОД(НДФЛСведенияОДоходах.МесяцНалоговогоПериода) < 2017
	|			ТОГДА ВЫБОР
	|					КОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|							И НДФЛСведенияОДоходах.КодДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОГДА СтавкиНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛСведенияОДоходах.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ)
	|					И НДФЛСведенияОДоходах.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|		КОГДА СтавкиНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА НДФЛСведенияОДоходах.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|					И НДФЛСведенияОДоходах.ДатаПолученияДохода >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоходРазделаПо13,
	|	НДФЛСведенияОДоходах.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТДоходыПоСтавкам
	|ИЗ
	|	ВТСтрокиДоходов КАК НДФЛСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
	|		ПО НДФЛСведенияОДоходах.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
	|			И НДФЛСведенияОДоходах.КодДохода = СтавкаНДФЛПоСтавкеРезидента.КодДохода
	|			И НДФЛСведенияОДоходах.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
	|			И НДФЛСведенияОДоходах.ПериодДляОпределенияСтатуса = СтавкаНДФЛПоСтавкеРезидента.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкиНДФЛ
	|		ПО НДФЛСведенияОДоходах.ФизическоеЛицо = СтавкиНДФЛ.ФизическоеЛицо
	|			И НДФЛСведенияОДоходах.КатегорияДохода = СтавкиНДФЛ.КатегорияДохода
	|			И НДФЛСведенияОДоходах.СтавкаНалогообложенияРезидента = СтавкиНДФЛ.СтавкаНалогообложенияРезидента
	|			И НДФЛСведенияОДоходах.ПериодДляОпределенияСтатуса = СтавкиНДФЛ.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицПоГодам
	|		ПО НДФЛСведенияОДоходах.ФизическоеЛицо = СтатусыФизЛицПоГодам.ФизическоеЛицо
	|			И (ГОД(НДФЛСведенияОДоходах.ПериодДляОпределенияСтатуса) = СтатусыФизЛицПоГодам.Год)
	|ГДЕ
	|	(НЕ НДФЛСведенияОДоходах.ИсточникДоходаЗаПределамиРФ
	|			ИЛИ СтатусыФизЛицПоГодам.Статус = &Резидент
	|			ИЛИ СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.ДистанционныйРаботник)
	|				И НДФЛСведенияОДоходах.КатегорияДохода В (&ДоходыОтТрудовойДеятельности)
	|				И НДФЛСведенияОДоходах.ДатаПолученияДохода >= ДАТАВРЕМЯ(2024, 1, 1, 0, 0, 0))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ) КАК Месяц,
	|	СУММА(НДФЛИмущественныеВычетыФизлиц.Сумма) КАК СуммаВычета,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ КАК Ставка,
	|	НДФЛИмущественныеВычетыФизлиц.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычета КАК КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ КАК КодВычетаКодДляОтчетности,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК МесяцПериодаПредоставленияВычета
	|ПОМЕСТИТЬ ВТВычетыПоСтавкам
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ИмущественныеВычетыНДФЛ КАК НДФЛИмущественныеВычетыФизлиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|			ПО НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|				И (ГОД(НДФЛИмущественныеВычетыФизлиц.Период) = СтатусыФизЛицНаКонецНалоговогоПериода.Год)
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация
	|			И СписокФизЛицОрганизация.ФизическоеЛицо = НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо
	|			И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И (НДФЛИмущественныеВычетыФизлиц.Период МЕЖДУ &НачалоНП И &КонецНП)
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ СписокФизЛицОрганизация.Организация = НДФЛИмущественныеВычетыФизлиц.Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ),
	|	НДФЛИмущественныеВычетыФизлиц.РегистрацияВНалоговомОргане,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ГоловнаяОрганизация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода, МЕСЯЦ),
	|	СУММА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Сумма),
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.РегистрацияВНалоговомОргане,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцПериодаПредоставленияВычета
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК НДФЛПредоставленныеСтандартныеВычетыФизЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|			ПО НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|				И (ГОД(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода) = СтатусыФизЛицНаКонецНалоговогоПериода.Год)
	|		ПО ВТСписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ГоловнаяОрганизация
	|			И ВТСписокФизЛицОрганизация.ФизическоеЛицо = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо
	|			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ ВТСписокФизЛицОрганизация.Организация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ГоловнаяОрганизация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.РегистрацияВНалоговомОргане,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцПериодаПредоставленияВычета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	База.ФизическоеЛицо КАК ФизическоеЛицо,
	|	База.НалоговаяБаза КАК НалоговаяБаза,
	|	База.Год КАК Год
	|ПОМЕСТИТЬ ВТСотрудникиСПревышением
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
	|		ДоходыПоСтавкам.СуммаДохода - ДоходыПоСтавкам.СуммаВычета КАК ОблагаемаяБаза,
	|		ДоходыПоСтавкам.Год КАК Год
	|	ИЗ
	|		ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|	ГДЕ
	|		ДоходыПоСтавкам.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		И ДоходыПоСтавкам.Год >= &ГодНачалаРасчетаНДФЛПоПрогрессивнойШкале
	|		И ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтандартныеИмущественныеВычеты.ФизическоеЛицо,
	|		ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда),
	|		-СтандартныеИмущественныеВычеты.СуммаВычета,
	|		ГОД(СтандартныеИмущественныеВычеты.Месяц)
	|	ИЗ
	|		ВТВычетыПоСтавкам КАК СтандартныеИмущественныеВычеты
	|	ГДЕ
	|		СтандартныеИмущественныеВычеты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		И ГОД(СтандартныеИмущественныеВычеты.Месяц) >= &ГодНачалаРасчетаНДФЛПоПрогрессивнойШкале) КАК База
	|
	|СГРУППИРОВАТЬ ПО
	|	База.ФизическоеЛицо,
	|	База.НалоговаяБаза,
	|	База.Год
	|
	|ИМЕЮЩИЕ
	|	СУММА(База.ОблагаемаяБаза) > &Предел";
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество > 0 Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.Год КАК Год,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
		|	НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.ДатаПолученияДохода, МЕСЯЦ) КАК НачалоМесяца,
		|	СведенияОДоходахНДФЛ.НалоговаяБаза КАК НалоговаяБаза,
		|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) КАК ОблагаемыйДоход,
		|	0 КАК ОблагаемыйДоходСНачалаГода,
		|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела,
		|	ЛОЖЬ КАК ПределПревышен
		|ИЗ
		|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
		|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
		|			И СведенияОДоходахНДФЛ.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
		|			И СведенияОДоходахНДФЛ.Год = СотрудникиСПревышением.Год
		|ГДЕ
		|	СведенияОДоходахНДФЛ.ОблагаетсяУНалоговогоАгента
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
		|	СведенияОДоходахНДФЛ.Год,
		|	СведенияОДоходахНДФЛ.НалоговаяБаза
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	НалоговаяБаза,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода";
		ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтандартныеИмущественныеВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(СтандартныеИмущественныеВычеты.СуммаВычета) КАК Сумма,
		|	СтандартныеИмущественныеВычеты.Месяц КАК НачалоМесяца
		|ИЗ
		|	ВТВычетыПоСтавкам КАК СтандартныеИмущественныеВычеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
		|		ПО СтандартныеИмущественныеВычеты.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
		|			И (ГОД(СтандартныеИмущественныеВычеты.Месяц) = СотрудникиСПревышением.Год)
		|			И (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) = СотрудникиСПревышением.НалоговаяБаза)
		|ГДЕ
		|	СтандартныеИмущественныеВычеты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|	И ГОД(СтандартныеИмущественныеВычеты.Месяц) >= &ГодНачалаРасчетаНДФЛПоПрогрессивнойШкале
		|
		|СГРУППИРОВАТЬ ПО
		|	СтандартныеИмущественныеВычеты.ФизическоеЛицо,
		|	СтандартныеИмущественныеВычеты.Месяц";
		ТаблицаВычетов = Запрос.Выполнить().Выгрузить();
		ИскатьВычеты = ТаблицаВычетов.Количество() > 0;
		Если ИскатьВычеты И ТаблицаВычетов.Количество() > 100 Тогда
			ТаблицаВычетов.Индексы.Добавить("ФизическоеЛицо,НачалоМесяца");
		КонецЕсли;
		ПоискВычетов = Новый Структура("ФизическоеЛицо,НачалоМесяца");
		
		// Расчет облагаемого дохода нарастающим итогом с учетом всех вычетов для каждой даты получения дохода.
		ОблагаемыйДоходСНачалаГода = 0;
		ТекущееФизлицо = Неопределено;
		ТекущаяНалоговаяБаза = Неопределено;
		ТекущееНачалоМесяца = Неопределено;
		ТекущийГод = Неопределено;
		Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
			Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Или ТекущийГод <> СтрокаТаблицы.Год Тогда
				ОблагаемыйДоходСНачалаГода = 0;
				ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
				ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
				ТекущийГод = СтрокаТаблицы.Год;
				ТекущееНачалоМесяца = Неопределено;
			КонецЕсли;
			// Стандартные, имущественные вычеты учтем один раз за каждый месяц - в первую дату получения дохода месяца.
			ПредоставленныеВычеты = 0;
			Если ИскатьВычеты И СтрокаТаблицы.НалоговаяБаза = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда И ТекущееНачалоМесяца <> СтрокаТаблицы.НачалоМесяца Тогда
				ЗаполнитьЗначенияСвойств(ПоискВычетов, СтрокаТаблицы);
				СтрокиВычетов = ТаблицаВычетов.НайтиСтроки(ПоискВычетов);
				Если СтрокиВычетов.Количество() > 0 Тогда
					ПредоставленныеВычеты = СтрокиВычетов[0].Сумма;
				КонецЕсли;
				ТекущееНачалоМесяца = СтрокаТаблицы.НачалоМесяца;
			КонецЕсли;
			СтрокаТаблицы.ЭтоДеньПревышенияПредела = ОблагаемыйДоходСНачалаГода < ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
			ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты;
			СтрокаТаблицы.ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода;
			СтрокаТаблицы.ПределПревышен = ОблагаемыйДоходСНачалаГода > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("РасчетНарастающимИтогом", ТаблицаРасчетаНарастающимИтогом); ТаблицаРасчетаНарастающимИтогом = Неопределено;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетНарастающимИтогом.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетНарастающимИтогом.Период КАК ДатаПолученияДохода,
		|	РасчетНарастающимИтогом.НалоговаяБаза КАК НалоговаяБаза,
		|	РасчетНарастающимИтогом.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
		|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела КАК ЭтоДеньПревышенияПредела,
		|	РасчетНарастающимИтогом.ПределПревышен КАК ПределПревышен
		|ПОМЕСТИТЬ ВТРасчетНарастающимИтогом
		|ИЗ
		|	&РасчетНарастающимИтогом КАК РасчетНарастающимИтогом
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоСтавкам.Год КАК Год,
		|	ДоходыПоСтавкам.Месяц КАК Месяц,
		|	ДоходыПоСтавкам.СуммаДохода КАК СуммаДохода,
		|	ДоходыПоСтавкам.СуммаВычета КАК СуммаВычета,
		|	ДоходыПоСтавкам.КодДохода КАК КодДохода,
		|	ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
		|	ДоходыПоСтавкам.КодДоходаКод КАК КодДоходаКод,
		|	ДоходыПоСтавкам.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
		|	ДоходыПоСтавкам.Ставка КАК Ставка,
		|	ДоходыПоСтавкам.СтавкаЧислом КАК СтавкаЧислом,
		|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	ДоходыПоСтавкам.МесяцНачисления КАК МесяцНачисления,
		|	ДоходыПоСтавкам.ДатаВыплаты КАК ДатаВыплаты,
		|	ДоходыПоСтавкам.ДатаПолученияДохода КАК ДатаПолученияДохода,
		|	ДоходыПоСтавкам.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
		|	ДоходыПоСтавкам.ДатаНачисления КАК ДатаНачисления,
		|	ДоходыПоСтавкам.КодВычета КАК КодВычета,
		|	ДоходыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
		|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
		|	ДоходыПоСтавкам.ДоходРазделаПо13 КАК ДоходРазделаПо13,
		|	ДоходыПоСтавкам.Период КАК Период,
		|	ДоходыПоСтавкам.КатегорияДохода КАК КатегорияДохода,
		|	ДоходыПоСтавкам.ДокументОснование КАК ДокументОснование,
		|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода, 0) КАК ОблагаемыйДоходСНачалаГода,
		|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела,
		|	ЕСТЬNULL(РасчетНарастающимИтогом.ПределПревышен, ЛОЖЬ) КАК ПределПревышен,
		|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоход, 0) КАК ОблагаемыйДоходЗаДень
		|ПОМЕСТИТЬ ВТРасширенныеДанныеОДоходах
		|ИЗ
		|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетНарастающимИтогом КАК РасчетНарастающимИтогом
		|		ПО ДоходыПоСтавкам.ФизическоеЛицо = РасчетНарастающимИтогом.ФизическоеЛицо
		|			И ДоходыПоСтавкам.ДатаПолученияДохода = РасчетНарастающимИтогом.ДатаПолученияДохода
		|			И ДоходыПоСтавкам.НалоговаяБаза = РасчетНарастающимИтогом.НалоговаяБаза
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК ДатаПолученияДохода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование КАК ДокументОснование,
		|	ВЫБОР
		|		КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма) <> 0
		|				И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) <> 0
		|			ТОГДА 3
		|		КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) <> 0
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ОписаниеДокументаСПревышением
		|ПОМЕСТИТЬ ВТОснованияВДниПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
		|		ПО РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
		|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
		|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
		|				ИЛИ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация = СписокФизЛицОрганизация.Организация)
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование В
		|			(ВЫБРАТЬ
		|				Основания.ДокументОснование
		|			ИЗ
		|				ВТРасширенныеДанныеОДоходах КАК Основания
		|			ГДЕ
		|				Основания.ЭтоДеньПревышенияПредела)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода) КАК СуммаДохода,
		|	СУММА(РасширенныеДанныеОДоходах.СуммаВычета) КАК СуммаВычета,
		|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) КАК ОблагаемаяСумма,
		|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасширенныеДанныеОДоходах.Год КАК Год,
		|	РасширенныеДанныеОДоходах.Месяц КАК Месяц,
		|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
		|	РасширенныеДанныеОДоходах.КодДоходаКод КАК КодДоходаКод,
		|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
		|	РасширенныеДанныеОДоходах.Ставка КАК Ставка,
		|	РасширенныеДанныеОДоходах.СтавкаЧислом КАК СтавкаЧислом,
		|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	РасширенныеДанныеОДоходах.МесяцНачисления КАК МесяцНачисления,
		|	РасширенныеДанныеОДоходах.ДатаВыплаты КАК ДатаВыплаты,
		|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
		|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
		|	РасширенныеДанныеОДоходах.ДатаНачисления КАК ДатаНачисления,
		|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
		|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
		|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
		|	РасширенныеДанныеОДоходах.ДоходРазделаПо13 КАК ДоходРазделаПо13,
		|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
		|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела КАК ЭтоДеньПревышенияПредела,
		|	РасширенныеДанныеОДоходах.ПределПревышен КАК ПределПревышен,
		|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень КАК ОблагаемыйДоходЗаДень,
		|	РасширенныеДанныеОДоходах.ДокументОснование КАК ДокументОснование,
		|	ЕСТЬNULL(ОснованияВДниПревышения.ОписаниеДокументаСПревышением, 1) КАК ОписаниеДокументаСПревышением
		|ИЗ
		|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияВДниПревышения КАК ОснованияВДниПревышения
		|		ПО РасширенныеДанныеОДоходах.ФизическоеЛицо = ОснованияВДниПревышения.ФизическоеЛицо
		|			И РасширенныеДанныеОДоходах.КатегорияДохода = ОснованияВДниПревышения.КатегорияДохода
		|			И РасширенныеДанныеОДоходах.ДокументОснование = ОснованияВДниПревышения.ДокументОснование
		|			И РасширенныеДанныеОДоходах.Период = ОснованияВДниПревышения.ДатаПолученияДохода
		|			И РасширенныеДанныеОДоходах.ГоловнаяОрганизация = ОснованияВДниПревышения.ГоловнаяОрганизация
		|ГДЕ
		|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
		|	И РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента
		|
		|СГРУППИРОВАТЬ ПО
		|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация,
		|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
		|	РасширенныеДанныеОДоходах.Год,
		|	РасширенныеДанныеОДоходах.Месяц,
		|	РасширенныеДанныеОДоходах.КодДохода,
		|	РасширенныеДанныеОДоходах.КодДоходаКод,
		|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности,
		|	РасширенныеДанныеОДоходах.Ставка,
		|	РасширенныеДанныеОДоходах.СтавкаЧислом,
		|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане,
		|	РасширенныеДанныеОДоходах.МесяцНачисления,
		|	РасширенныеДанныеОДоходах.ДатаВыплаты,
		|	РасширенныеДанныеОДоходах.ДатаПолученияДохода,
		|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована,
		|	РасширенныеДанныеОДоходах.ДатаНачисления,
		|	РасширенныеДанныеОДоходах.КодВычета,
		|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности,
		|	РасширенныеДанныеОДоходах.НалоговаяБаза,
		|	РасширенныеДанныеОДоходах.ДоходРазделаПо13,
		|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода,
		|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела,
		|	РасширенныеДанныеОДоходах.ПределПревышен,
		|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень,
		|	РасширенныеДанныеОДоходах.ДокументОснование,
		|	ОснованияВДниПревышения.ОписаниеДокументаСПревышением
		|
		|ИМЕЮЩИЕ
		|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Год,
		|	ФизическоеЛицо,
		|	НалоговаяБаза,
		|	КодДохода";
		
		ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
		ДоходыСУточненнымиСтавками = ТаблицаРасчетаНарастающимИтогом.СкопироватьКолонки();
		
		ТекущееФизлицо = Неопределено;
		ТекущаяНалоговаяБаза = Неопределено;
		ТекущийГод = Неопределено;
		СтрокиРаспределения = Новый Массив;
		ОблагаемыйДоходДоПредела = 0;
		Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
			Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущийГод <> СтрокаТаблицы.Год Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Тогда
				Если ОблагаемыйДоходДоПредела <> 0 Тогда
					УчетНДФЛЗаполнениеОтчетности.ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)				
				КонецЕсли;
				СтрокиРаспределения = Новый Массив;
				ОблагаемыйДоходДоПредела = 0;
				ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
				ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
				ТекущийГод = СтрокаТаблицы.Год;
			КонецЕсли;
			Если ОблагаемыйДоходДоПредела = 0 Тогда
				ОблагаемыйДоходДоПредела = СтрокаТаблицы.ОблагаемыйДоходЗаДень - СтрокаТаблицы.ОблагаемыйДоходСНачалаГода + ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел
			КонецЕсли;
			СтрокиРаспределения.Добавить(СтрокаТаблицы);
		КонецЦикла;
		Если ОблагаемыйДоходДоПредела <> 0 Тогда
			УчетНДФЛЗаполнениеОтчетности.ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)				
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРасчетаНарастающимИтогом, ДоходыСУточненнымиСтавками); ТаблицаРасчетаНарастающимИтогом = Неопределено;
		
		Запрос.УстановитьПараметр("ДоходыСУточненнымиСтавками", ДоходыСУточненнымиСтавками); ДоходыСУточненнымиСтавками = Неопределено;
		Запрос.Текст =
		"УНИЧТОЖИТЬ ВТДоходыПоСтавкам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыСУточненнымиСтавками.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ДоходыСУточненнымиСтавками.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыСУточненнымиСтавками.Год КАК Год,
		|	ДоходыСУточненнымиСтавками.Месяц КАК Месяц,
		|	ДоходыСУточненнымиСтавками.СуммаДохода КАК СуммаДохода,
		|	ДоходыСУточненнымиСтавками.СуммаВычета КАК СуммаВычета,
		|	ДоходыСУточненнымиСтавками.КодДохода КАК КодДохода,
		|	ДоходыСУточненнымиСтавками.КодДоходаКод КАК КодДоходаКод,
		|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
		|	ВЫБОР
		|		КОГДА ДоходыСУточненнымиСтавками.ОписаниеДокументаСПревышением = 2
		|			ТОГДА &СтавкаСПревышения
		|		ИНАЧЕ ДоходыСУточненнымиСтавками.Ставка
		|	КОНЕЦ КАК Ставка,
		|	ВЫБОР
		|		КОГДА ДоходыСУточненнымиСтавками.ОписаниеДокументаСПревышением = 2
		|			ТОГДА &СтавкаЧисломСПревышения
		|		ИНАЧЕ ДоходыСУточненнымиСтавками.СтавкаЧислом
		|	КОНЕЦ КАК СтавкаЧислом,
		|	ДоходыСУточненнымиСтавками.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	ДоходыСУточненнымиСтавками.МесяцНачисления КАК МесяцНачисления,
		|	ДоходыСУточненнымиСтавками.ДатаВыплаты КАК ДатаВыплаты,
		|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода КАК ДатаПолученияДохода,
		|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
		|	ДоходыСУточненнымиСтавками.ДатаНачисления КАК ДатаНачисления,
		|	ДоходыСУточненнымиСтавками.КодВычета КАК КодВычета,
		|	ДоходыСУточненнымиСтавками.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
		|	ДоходыСУточненнымиСтавками.НалоговаяБаза КАК НалоговаяБаза,
		|	ДоходыСУточненнымиСтавками.ДоходРазделаПо13 КАК ДоходРазделаПо13
		|ПОМЕСТИТЬ ВТДоходыСУточненнымиСтавками
		|ИЗ
		|	&ДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
		|			ТОГДА &СтавкаЧисломСПревышения
		|		ИНАЧЕ РасширенныеДанныеОДоходах.СтавкаЧислом
		|	КОНЕЦ КАК СтавкаЧислом,
		|	ВЫБОР
		|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
		|			ТОГДА &СтавкаСПревышения
		|		ИНАЧЕ РасширенныеДанныеОДоходах.Ставка
		|	КОНЕЦ КАК Ставка,
		|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасширенныеДанныеОДоходах.Год КАК Год,
		|	РасширенныеДанныеОДоходах.Месяц КАК Месяц,
		|	РасширенныеДанныеОДоходах.СуммаДохода КАК СуммаДохода,
		|	РасширенныеДанныеОДоходах.СуммаВычета КАК СуммаВычета,
		|	РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
		|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
		|	РасширенныеДанныеОДоходах.КодДоходаКод КАК КодДоходаКод,
		|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
		|	РасширенныеДанныеОДоходах.МесяцНачисления КАК МесяцНачисления,
		|	РасширенныеДанныеОДоходах.ДатаВыплаты КАК ДатаВыплаты,
		|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
		|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
		|	РасширенныеДанныеОДоходах.ДатаНачисления КАК ДатаНачисления,
		|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
		|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
		|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
		|	РасширенныеДанныеОДоходах.ДоходРазделаПо13 КАК ДоходРазделаПо13
		|ПОМЕСТИТЬ ВТДоходыПоСтавкам
		|ИЗ
		|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
		|ГДЕ
		|	(НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
		|			ИЛИ НЕ РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДоходыСУточненнымиСтавками.СтавкаЧислом,
		|	ДоходыСУточненнымиСтавками.Ставка,
		|	ДоходыСУточненнымиСтавками.РегистрацияВНалоговомОргане,
		|	ДоходыСУточненнымиСтавками.ГоловнаяОрганизация,
		|	ДоходыСУточненнымиСтавками.ФизическоеЛицо,
		|	ДоходыСУточненнымиСтавками.Год,
		|	ДоходыСУточненнымиСтавками.Месяц,
		|	ДоходыСУточненнымиСтавками.СуммаДохода,
		|	ДоходыСУточненнымиСтавками.СуммаВычета,
		|	ИСТИНА,
		|	ДоходыСУточненнымиСтавками.КодДохода,
		|	ДоходыСУточненнымиСтавками.КодДоходаКод,
		|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности,
		|	ДоходыСУточненнымиСтавками.МесяцНачисления,
		|	ДоходыСУточненнымиСтавками.ДатаВыплаты,
		|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода,
		|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаФиксирована,
		|	ДоходыСУточненнымиСтавками.ДатаНачисления,
		|	ДоходыСУточненнымиСтавками.КодВычета,
		|	ДоходыСУточненнымиСтавками.КодВычетаКодДляОтчетности,
		|	ДоходыСУточненнымиСтавками.НалоговаяБаза,
		|	ДоходыСУточненнымиСтавками.ДоходРазделаПо13
		|ИЗ
		|	ВТДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками";
		Запрос.Выполнить();
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) КАК ГОД,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогНачислено,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения < НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|						ТОГДА НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов - НДФЛРасчетыСБюджетом.СуммаСПревышения
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогКЗачету,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|			ТОГДА НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогУдержано,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|				И ВЫБОР
	|					КОГДА ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) < 2017
	|						ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ
	|					ИНАЧЕ СтавкиНДФЛ.СтавкаНДФЛ
	|				КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				И ВЫБОР
	|					КОГДА ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) < 2017
	|						ТОГДА СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.СтавкаНДФЛ
	|					ИНАЧЕ СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНДФЛ
	|				КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УдержаноКЗачетуПоСтавке13,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	|			ТОГДА НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогПереданоНаВзыскание,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	|			ТОГДА -НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогВозвращено,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК Месяц,
	|	НДФЛРасчетыСБюджетом.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) < 2017
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ
	|		ИНАЧЕ СтавкиНДФЛ.СтавкаНДФЛ
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) < 2017
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.СтавкаНДФЛ
	|		ИНАЧЕ СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНДФЛ
	|	КОНЕЦ КАК СтавкаПоИтогамГода,
	|	НДФЛРасчетыСБюджетом.КодДохода КАК КодДохода,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления КАК СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТДанныеОНалогах
	|ИЗ
	|	ВТСтрокиНалогов КАК НДФЛРасчетыСБюджетом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КодДохода = СтавкаНДФЛПоСтавкеРезидента.КодДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
	|			И НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса = СтавкаНДФЛПоСтавкеРезидента.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КодДохода = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.КодДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.СтавкаНалогообложенияРезидента
	|			И (КОНЕЦПЕРИОДА(НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса, ГОД) = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкиНДФЛ
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкиНДФЛ.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КатегорияДохода = СтавкиНДФЛ.КатегорияДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкиНДФЛ.СтавкаНалогообложенияРезидента
	|			И НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса = СтавкиНДФЛ.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкаНДФЛНаКонецНалоговогоПериода
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛНаКонецНалоговогоПериода.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КатегорияДохода = СтавкаНДФЛНаКонецНалоговогоПериода.КатегорияДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНалогообложенияРезидента
	|			И (КОНЕЦПЕРИОДА(НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса, ГОД) = СтавкаНДФЛНаКонецНалоговогоПериода.Период)
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.Сумма <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода),
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения < НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|						ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|					ИНАЧЕ НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|				И СтавкиНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				И СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	|			ТОГДА -НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.Период,
	|	ВЫБОР
	|		КОГДА СтавкиНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ СтавкиНДФЛ.СтавкаНДФЛ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНДФЛ
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.КодДохода,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТСтрокиНалогов КАК НДФЛРасчетыСБюджетом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкиНДФЛ
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкиНДФЛ.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КатегорияДохода = СтавкиНДФЛ.КатегорияДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкиНДФЛ.СтавкаНалогообложенияРезидента
	|			И НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса = СтавкиНДФЛ.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкаНДФЛНаКонецНалоговогоПериода
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛНаКонецНалоговогоПериода.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КатегорияДохода = СтавкаНДФЛНаКонецНалоговогоПериода.КатегорияДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНалогообложенияРезидента
	|			И (КОНЕЦПЕРИОДА(НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса, ГОД) = СтавкаНДФЛНаКонецНалоговогоПериода.Период)
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|	И НДФЛРасчетыСБюджетом.СуммаСПревышения <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Авансы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Авансы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ГОД(Авансы.МесяцНалоговогоПериода) КАК ГОД,
	|	Авансы.Сумма КАК Зачтено,
	|	Авансы.МесяцНалоговогоПериода КАК Месяц,
	|	Авансы.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ГОД(Авансы.МесяцНалоговогоПериода) < 2017
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ
	|		ИНАЧЕ СтавкиНДФЛ.СтавкаНДФЛ
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА ГОД(Авансы.МесяцНалоговогоПериода) < 2017
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.СтавкаНДФЛ
	|		ИНАЧЕ СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНДФЛ
	|	КОНЕЦ КАК СтавкаПоИтогамГода,
	|	Авансы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТДанныеОЗачтенныхАвансах
	|ИЗ
	|	ВТСтрокиАвансов КАК Авансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
	|		ПО Авансы.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
	|			И Авансы.КодДохода = СтавкаНДФЛПоСтавкеРезидента.КодДохода
	|			И Авансы.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
	|			И Авансы.ПериодДляОпределенияСтатуса = СтавкаНДФЛПоСтавкеРезидента.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода
	|		ПО Авансы.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.ФизическоеЛицо
	|			И Авансы.КодДохода = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.КодДохода
	|			И Авансы.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.СтавкаНалогообложенияРезидента
	|			И (КОНЕЦПЕРИОДА(Авансы.ПериодДляОпределенияСтатуса, ГОД) = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкиНДФЛ
	|		ПО Авансы.ФизическоеЛицо = СтавкиНДФЛ.ФизическоеЛицо
	|			И Авансы.КатегорияДохода = СтавкиНДФЛ.КатегорияДохода
	|			И Авансы.СтавкаНалогообложенияРезидента = СтавкиНДФЛ.СтавкаНалогообложенияРезидента
	|			И Авансы.ПериодДляОпределенияСтатуса = СтавкиНДФЛ.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкаНДФЛНаКонецНалоговогоПериода
	|		ПО Авансы.ФизическоеЛицо = СтавкаНДФЛНаКонецНалоговогоПериода.ФизическоеЛицо
	|			И Авансы.КатегорияДохода = СтавкаНДФЛНаКонецНалоговогоПериода.КатегорияДохода
	|			И Авансы.СтавкаНалогообложенияРезидента = СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНалогообложенияРезидента
	|			И (КОНЕЦПЕРИОДА(Авансы.ПериодДляОпределенияСтатуса, ГОД) = СтавкаНДФЛНаКонецНалоговогоПериода.Период)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыПоСтавкам.Месяц КАК Месяц,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	|	ВычетыПоСтавкам.Ставка КАК Ставка,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТВычетыСгруппированныеДанные
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо,
	|	ВычетыПоСтавкам.Месяц,
	|	ВычетыПоСтавкам.Ставка,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходахПоРазделам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СведенияОДоходахПоРазделам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходахПоРазделам.Месяц КАК Месяц,
	|	СУММА(СведенияОДоходахПоРазделам.СуммаДохода) КАК СуммаДохода,
	|	СведенияОДоходахПоРазделам.НалоговаяБаза КАК НалоговаяБаза,
	|	СведенияОДоходахПоРазделам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТДоходыПоМесяцамПоСтавке13Итог
	|ИЗ
	|	ВТДоходыПоСтавкам КАК СведенияОДоходахПоРазделам
	|ГДЕ
	|	СведенияОДоходахПоРазделам.ДоходРазделаПо13
	|	И СведенияОДоходахПоРазделам.ОблагаетсяУНалоговогоАгента
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходахПоРазделам.ГоловнаяОрганизация,
	|	СведенияОДоходахПоРазделам.ФизическоеЛицо,
	|	СведенияОДоходахПоРазделам.Месяц,
	|	СведенияОДоходахПоРазделам.НалоговаяБаза,
	|	СведенияОДоходахПоРазделам.РегистрацияВНалоговомОргане
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДоходыПоСтавкам.Год КАК Год,
	|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
	|	ДоходыПоСтавкам.Месяц КАК Месяц,
	|	ДоходыПоСтавкам.Ставка КАК Ставка,
	|	ЕСТЬNULL(МАКСИМУМ(ПредыдущийМесяц.Месяц), ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДоходыПоСтавкам.Месяц, ГОД), СЕКУНДА, -1)) КАК ПредыдущийМесяц,
	|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТДоходыПо13
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоСтавкам КАК ПредыдущийМесяц
	|		ПО ДоходыПоСтавкам.ГоловнаяОрганизация = ПредыдущийМесяц.ГоловнаяОрганизация
	|			И ДоходыПоСтавкам.ФизическоеЛицо = ПредыдущийМесяц.ФизическоеЛицо
	|			И ДоходыПоСтавкам.Год = ПредыдущийМесяц.Год
	|			И ДоходыПоСтавкам.НалоговаяБаза = ПредыдущийМесяц.НалоговаяБаза
	|			И ДоходыПоСтавкам.Месяц > ПредыдущийМесяц.Месяц
	|			И ДоходыПоСтавкам.РегистрацияВНалоговомОргане = ПредыдущийМесяц.РегистрацияВНалоговомОргане
	|			И ДоходыПоСтавкам.ДоходРазделаПо13 = ПредыдущийМесяц.ДоходРазделаПо13
	|			И ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента = ПредыдущийМесяц.ОблагаетсяУНалоговогоАгента
	|ГДЕ
	|	ДоходыПоСтавкам.ДоходРазделаПо13
	|	И ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыПоСтавкам.ГоловнаяОрганизация,
	|	ДоходыПоСтавкам.ФизическоеЛицо,
	|	ДоходыПоСтавкам.НалоговаяБаза,
	|	ДоходыПоСтавкам.Год,
	|	ДоходыПоСтавкам.Месяц,
	|	ДоходыПоСтавкам.Ставка,
	|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыПо13.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДоходыПо13.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДоходыПо13.Год КАК Год,
	|	ДоходыПо13.Месяц КАК Месяц,
	|	ДоходыПо13.НалоговаяБаза КАК НалоговаяБаза,
	|	ДоходыПо13.Ставка КАК Ставка,
	|	ДоходыПо13.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СУММА(ДоходыПоСтавкам.СуммаДохода) КАК СуммаДохода,
	|	СУММА(ДоходыПоСтавкам.СуммаВычета) КАК СуммаВычета
	|ПОМЕСТИТЬ ВТДоходыДоПолученияСтатусаРезидента
	|ИЗ
	|	ВТДоходыПо13 КАК ДоходыПо13
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|		ПО ДоходыПо13.ГоловнаяОрганизация = ДоходыПоСтавкам.ГоловнаяОрганизация
	|			И ДоходыПо13.ФизическоеЛицо = ДоходыПоСтавкам.ФизическоеЛицо
	|			И (ДоходыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
	|			И ДоходыПо13.Месяц > ДоходыПоСтавкам.Месяц
	|			И ДоходыПо13.ПредыдущийМесяц < ДоходыПоСтавкам.Месяц
	|			И ДоходыПо13.Год = ДоходыПоСтавкам.Год
	|			И ДоходыПо13.НалоговаяБаза = ДоходыПоСтавкам.НалоговаяБаза
	|			И ДоходыПо13.РегистрацияВНалоговомОргане = ДоходыПоСтавкам.РегистрацияВНалоговомОргане
	|			И (ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыПо13.Год,
	|	ДоходыПо13.ГоловнаяОрганизация,
	|	ДоходыПо13.ФизическоеЛицо,
	|	ДоходыПо13.Месяц,
	|	ДоходыПо13.НалоговаяБаза,
	|	ДоходыПо13.Ставка,
	|	ДоходыПо13.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период КАК Период,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка КАК Ставка,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма КАК Сумма,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РеквизитыПлатежногоПоручения КАК РеквизитыПП,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ПОМЕСТИТЬ ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|ИЗ
	|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбособленныеПодразделения КАК СписокФизЛицОрганизация
	|		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И (РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация = СписокФизЛицОрганизация.Организация
	|ГДЕ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма <> 0
	|	И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода КАК Месяц,
	|	МИНИМУМ(ДанныеОНалогах.Период) КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТПерваяСтрокаПеречисленногоНалогаЗаМесяц
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК ДанныеОНалогах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.ГОД КАК ГОД,
	|	ДанныеОНалогах.Месяц КАК МесяцНалоговогоПериода,
	|	ДанныеОНалогах.СтавкаПоИтогамГода КАК Ставка,
	|	СУММА(ДанныеОНалогах.НалогУдержано) КАК Налог,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТУдержаноНДФЛПоМесяцам
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.ГОД,
	|	ДанныеОНалогах.Месяц,
	|	ДанныеОНалогах.СтавкаПоИтогамГода,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СУММА(ДанныеОНалогах.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТПеречисленоНДФЛПоМесяцам
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК ДанныеОНалогах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Перечислено.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Перечислено.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Перечислено.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	Перечислено.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) + ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Перечислено.Сумма - (ВЫРАЗИТЬ(Перечислено.Сумма * ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) / (ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) + ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0)) КАК ЧИСЛО(22, 0)))
	|	КОНЕЦ КАК КЗачетуПоСтавке13
	|ПОМЕСТИТЬ ВТКЗачетуПоПеречислениям
	|ИЗ
	|	ВТПеречисленоНДФЛПоМесяцам КАК Перечислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержаноНДФЛПоМесяцам КАК УдержаноНДФЛПоСтавке13
	|		ПО Перечислено.ФизическоеЛицо = УдержаноНДФЛПоСтавке13.ФизическоеЛицо
	|			И Перечислено.МесяцНалоговогоПериода = УдержаноНДФЛПоСтавке13.МесяцНалоговогоПериода
	|			И (УдержаноНДФЛПоСтавке13.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13))
	|			И Перечислено.ГоловнаяОрганизация = УдержаноНДФЛПоСтавке13.ГоловнаяОрганизация
	|			И Перечислено.РегистрацияВНалоговомОргане = УдержаноНДФЛПоСтавке13.РегистрацияВНалоговомОргане
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержаноНДФЛПоМесяцам КАК УдержаноНДФЛПоСтавке30
	|		ПО Перечислено.ФизическоеЛицо = УдержаноНДФЛПоСтавке30.ФизическоеЛицо
	|			И Перечислено.МесяцНалоговогоПериода = УдержаноНДФЛПоСтавке30.МесяцНалоговогоПериода
	|			И (УдержаноНДФЛПоСтавке30.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
	|			И Перечислено.ГоловнаяОрганизация = УдержаноНДФЛПоСтавке30.ГоловнаяОрганизация
	|			И Перечислено.РегистрацияВНалоговомОргане = УдержаноНДФЛПоСтавке30.РегистрацияВНалоговомОргане
	|ГДЕ
	|	Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&КонецНП КАК Период,
	|	СтандартныеВычетыПоМесяцамРезидентства.КодВычетаЛичный КАК КодВычета
	|ПОМЕСТИТЬ ВТСтандартныеВычетыВсе
	|ИЗ
	|	ВТСтандартныеВычетыПоМесяцамРезидентства КАК СтандартныеВычетыПоМесяцамРезидентства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТВсеРегистрации
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОЗачтенныхАвансах.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОЗачтенныхАвансах КАК ДанныеОЗачтенныхАвансах";
	Запрос.Выполнить();
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"РазмерВычетовНДФЛ",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТСтандартныеВычетыВсе",
			"Период,КодВычета"));
			
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗачтенныеАвансы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ЗачтенныеАвансы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗачтенныеАвансы.Месяц КАК Месяц,
	|	ЗачтенныеАвансы.Период КАК Дата,
	|	ЗачтенныеАвансы.Ставка КАК Ставка,
	|	ЗачтенныеАвансы.Зачтено КАК ЗачтеноАвансов,
	|	ЗачтенныеАвансы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ЗачтенныеАвансы.СтавкаПоИтогамГода КАК СтавкаПоИтогамГода
	|ИЗ
	|	ВТДанныеОЗачтенныхАвансах КАК ЗачтенныеАвансы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрацииВНалоговомОргане.КодПоОКАТО КАК КодПоОКАТО,
	|	РегистрацииВНалоговомОргане.КодПоОКТМО КАК КодПоОКТМО,
	|	РегистрацииВНалоговомОргане.КПП КАК КПП,
	|	РегистрацииВНалоговомОргане.Ссылка КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|ГДЕ
	|	РегистрацииВНалоговомОргане.Ссылка В
	|			(ВЫБРАТЬ
	|				ВсеРегистрации.РегистрацияВНалоговомОргане
	|			ИЗ
	|				ВТВсеРегистрации КАК ВсеРегистрации)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВычетыПоСтавкам.Месяц КАК Месяц,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|ГДЕ
	|	ВычетыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.ФизическоеЛицо,
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.Месяц,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Месяц
	|ИТОГИ
	|	СУММА(СуммаВычета)
	|ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусФизЛицНаКонецМесяца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КОНЕЦПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) КАК Месяц,
	|	СтатусФизЛицНаКонецМесяца.Статус КАК Статус
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо,
	|	Месяц
	|ИТОГИ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПодтверждения.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДокументыПодтверждения.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.ДатаУведомления) КАК ДатаУведомления,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.НомерУведомления) КАК Номер,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.КодНалоговогоОргана) КАК КодОрганаУведомление
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТСписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ВТСписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		МАКСИМУМ(НДФЛИмущественныеВычетыФизлиц.Регистратор) КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.ИмущественныеВычетыНДФЛ КАК НДФЛИмущественныеВычетыФизлиц
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|			ПО НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо = ВТСписокФизЛицОрганизация.ФизическоеЛицо
	|				И НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация = ВТСписокФизЛицОрганизация.ГоловнаяОрганизация
	|				И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП
	|					ИЛИ НДФЛИмущественныеВычетыФизлиц.Организация = ВТСписокФизЛицОрганизация.Организация)
	|				И (НДФЛИмущественныеВычетыФизлиц.Год = ГОД(&НачалоНП))
	|				И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТСписокФизЛицОрганизация.ФизическоеЛицо,
	|		ВТСписокФизЛицОрганизация.ГоловнаяОрганизация) КАК ДокументыПодтверждения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ КАК НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации
	|		ПО ДокументыПодтверждения.Регистратор = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Ссылка
	|			И ДокументыПодтверждения.ФизическоеЛицо = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыПодтверждения.ГоловнаяОрганизация,
	|	ДокументыПодтверждения.ФизическоеЛицо
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеДатыСправок.Дата КАК ДатаСправки,
	|	МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.НомерСправки) КАК НомерСправки,
	|	МаксимальныеДатыСправок.Сотрудник КАК ФизическоеЛицо,
	|	1 КАК ТипСправки,
	|	ПРЕДСТАВЛЕНИЕ(МаксимальныеДатыСправок.РегистрацияВНалоговомОргане) КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	(ВЫБРАТЬ
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|		МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата) КАК Дата,
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Сотрудники КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|			ПО СписокФизЛицОрганизация.ФизическоеЛицо = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|				И СписокФизЛицОрганизация.ГоловнаяОрганизация = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ОснованиеДляПредставленияСправок В (ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ЕжегоднаяОтчетностьЗаРеорганизованнуюОрганизацию), ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ЕжегоднаяОтчетность)))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник,
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.РегистрацияВНалоговомОргане) КАК МаксимальныеДатыСправок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Сотрудники КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|		ПО МаксимальныеДатыСправок.Сотрудник = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|			И МаксимальныеДатыСправок.Дата = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата
	|			И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныеДатыСправок.Сотрудник,
	|	МаксимальныеДатыСправок.Дата,
	|	ПРЕДСТАВЛЕНИЕ(МаксимальныеДатыСправок.РегистрацияВНалоговомОргане)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МаксимальныеДатыСправок.Дата,
	|	МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.НомерСправки),
	|	МаксимальныеДатыСправок.Сотрудник,
	|	3,
	|	ПРЕДСТАВЛЕНИЕ(МаксимальныеДатыСправок.РегистрацияВНалоговомОргане)
	|ИЗ
	|	(ВЫБРАТЬ
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|		МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата) КАК Дата,
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Сотрудники КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|			ПО СписокФизЛицОрганизация.ФизическоеЛицо = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|				И СписокФизЛицОрганизация.ГоловнаяОрганизация = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ОснованиеДляПредставленияСправок В (ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ОНевозможностиУдержанияНДФЛЗаРеорганизованнуюОрганизацию), ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ОНевозможностиУдержанияНДФЛ)))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник,
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.РегистрацияВНалоговомОргане) КАК МаксимальныеДатыСправок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Сотрудники КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|		ПО МаксимальныеДатыСправок.Сотрудник = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|			И МаксимальныеДатыСправок.Дата = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата
	|			И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныеДатыСправок.Сотрудник,
	|	МаксимальныеДатыСправок.Дата,
	|	ПРЕДСТАВЛЕНИЕ(МаксимальныеДатыСправок.РегистрацияВНалоговомОргане)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоследниеДатыСправок.Дата,
	|	МАКСИМУМ(СправкаПоНДФЛСотруднику.Номер),
	|	ПоследниеДатыСправок.ФизическоеЛицо,
	|	2,
	|	NULL
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|		МАКСИМУМ(СправкаПоНДФЛСотруднику.Дата) КАК Дата
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаНДФЛ КАК СправкаПоНДФЛСотруднику
	|			ПО СписокФизЛицОрганизация.ФизическоеЛицо = СправкаПоНДФЛСотруднику.Сотрудник
	|				И СписокФизЛицОрганизация.ГоловнаяОрганизация = СправкаПоНДФЛСотруднику.Организация.ГоловнаяОрганизация
	|				И (СправкаПоНДФЛСотруднику.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛСотруднику.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокФизЛицОрганизация.ФизическоеЛицо) КАК ПоследниеДатыСправок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаНДФЛ КАК СправкаПоНДФЛСотруднику
	|		ПО ПоследниеДатыСправок.Дата = СправкаПоНДФЛСотруднику.Дата
	|			И ПоследниеДатыСправок.ФизическоеЛицо = СправкаПоНДФЛСотруднику.Сотрудник
	|			И (СправкаПоНДФЛСотруднику.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеДатыСправок.ФизическоеЛицо,
	|	ПоследниеДатыСправок.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо,
	|	ТипСправки
	|ИТОГИ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтандартныеВычетыФизЛицОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтандартныеВычетыФизЛицОрганизации.Месяц КАК Месяц,
	|	ВЫБОР
	|		КОГДА СтандартныеВычетыФизЛицОрганизации.Месяц < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА СтандартныеВычетыФизЛицОрганизации.Месяц < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА СтандартныеВычетыФизЛицОрганизации.Месяц < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА СтандартныеВычетыФизЛицОрганизации.Месяц < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ КАК КодВычета,
	|	СтандартныеВычетыФизЛицОрганизации.КоличествоДетей КАК КоличествоДетей,
	|	СтандартныеВычетыФизЛицОрганизации.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ЕСТЬNULL(СтандартныеВычетыФизЛицОрганизации.КоличествоДетей, 1) * ЕСТЬNULL(НДФЛРазмерВычетовСрезПоследних.Размер, 0) КАК Размер,
	|	ВЫРАЗИТЬ(СтандартныеВычетыФизЛицОрганизации.Основание КАК СТРОКА(1000)) КАК Основание
	|ИЗ
	|	ВТСтандартныеВычетыФизЛицОрганизации КАК СтандартныеВычетыФизЛицОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРазмерВычетовНДФЛСрезПоследних КАК НДФЛРазмерВычетовСрезПоследних
	|		ПО СтандартныеВычетыФизЛицОрганизации.КодВычета = НДФЛРазмерВычетовСрезПоследних.КодВычета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО СтандартныеВычетыФизЛицОрганизации.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И СтандартныеВычетыФизЛицОрганизации.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовНДФЛ КАК ВидыВычетовНДФЛ
	|		ПО СтандартныеВычетыФизЛицОрганизации.КодВычета = ВидыВычетовНДФЛ.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	КодВычета,
	|	Месяц
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоциальныеИИмущественныеВычеты.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СоциальныеИИмущественныеВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ КАК КодВычетаКод,
	|	СоциальныеИИмущественныеВычеты.Размер КАК Размер,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.ДатаУведомления) КАК ДатаУведомления,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.НомерУведомления) КАК Номер,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.КодНалоговогоОргана) КАК КодОрганаУведомление,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(СоциальныеИИмущественныеВычеты.Дата, МЕСЯЦ) = СтатусФизЛицНаКонецМесяца.Месяц
	|				ТОГДА СоциальныеИИмущественныеВычеты.Дата
	|			ИНАЧЕ СтатусФизЛицНаКонецМесяца.Месяц
	|		КОНЕЦ) КАК Дата
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСоциальныеИИмущественныеВычеты КАК СоциальныеИИмущественныеВычеты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ КАК НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации
	|			ПО СоциальныеИИмущественныеВычеты.Регистратор = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Ссылка
	|				И СоциальныеИИмущественныеВычеты.ФизическоеЛицо = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Сотрудник
	|		ПО СтатусФизЛицНаКонецМесяца.ФизическоеЛицо = СоциальныеИИмущественныеВычеты.ФизическоеЛицо
	|			И (КОНЕЦПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) >= СоциальныеИИмущественныеВычеты.Дата)
	|ГДЕ
	|	СтатусФизЛицНаКонецМесяца.ЯвляетсяРезидентомРФ
	|
	|СГРУППИРОВАТЬ ПО
	|	СоциальныеИИмущественныеВычеты.ФизическоеЛицо,
	|	СоциальныеИИмущественныеВычеты.Размер,
	|	СоциальныеИИмущественныеВычеты.Дата,
	|	СоциальныеИИмущественныеВычеты.ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	КодВычетаКод,
	|	Дата
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Доходы.Раздел КАК Раздел,
	|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	МАКСИМУМ(Доходы.СуммаДоходаДоРезидентства) КАК СуммаДоходаДоРезидентства,
	|	МАКСИМУМ(Доходы.СуммаВычетаДоРезидентства) КАК СуммаВычетаДоРезидентства,
	|	МАКСИМУМ(Доходы.ОблагаемаяСуммаДоходаДоРезидентства) КАК ОблагаемаяСуммаДоходаДоРезидентства,
	|	Доходы.ДатаНачисления КАК ДатаНачисления,
	|	Доходы.МесяцНачисления КАК МесяцНачисления,
	|	Доходы.ДатаВыплаты КАК ДатаВыплаты,
	|	Доходы.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	Доходы.КодДоходаСсылка КАК КодДоходаСсылка,
	|	СУММА(Доходы.СуммаДохода) КАК СуммаДохода,
	|	Доходы.КодВычетаСсылка КАК КодВычетаСсылка,
	|	СУММА(Доходы.СуммаВычета) КАК СуммаВычета,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.ОблагаетсяУНалоговогоАгента
	|				ТОГДА Доходы.ОблагаемаяСуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаемаяСуммаДохода,
	|	СУММА(Доходы.НалогНачислено) КАК НалогНачислено,
	|	Доходы.КодДохода КАК КодДохода,
	|	Доходы.КодВычета КАК КодВычета,
	|	Доходы.Ставка КАК Ставка,
	|	ВЫБОР
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаОбъединенияНалоговыхБаз
	|			ТОГДА &ОбъединеннаяНалоговаяБазаСтрокой
	|		ИНАЧЕ ОписаниеНалоговыхБаз.ПредставлениеНалоговойБазы
	|	КОНЕЦ КАК НалоговаяБаза,
	|	ОписаниеНалоговыхБаз.ПорядокНалоговойБазы КАК ПорядокНалоговойБазы,
	|	Доходы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				ТОГДА Доходы.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода13,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|				ТОГДА Доходы.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода15,
	|	СотрудникиСПревышением.ФизическоеЛицо ЕСТЬ НЕ NULL  КАК ЭтоФизическоеЛицоСПревышением
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоходыПоМесяцам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		ДоходыПоМесяцам.ФизическоеЛицо КАК ФизическоеЛицо,
	|		""Раздел4_Ставка13"" КАК Раздел,
	|		ДоходыПоМесяцам.Месяц КАК МесяцНалоговогоПериода,
	|		ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаДохода, 0) КАК СуммаДоходаДоРезидентства,
	|		ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаВычета, 0) КАК СуммаВычетаДоРезидентства,
	|		ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаДохода, 0) - ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаВычета, 0) КАК ОблагаемаяСуммаДоходаДоРезидентства,
	|		ДоходыПоМесяцам.ДатаНачисления КАК ДатаНачисления,
	|		ДоходыПоМесяцам.МесяцНачисления КАК МесяцНачисления,
	|		ДоходыПоМесяцам.ДатаВыплаты КАК ДатаВыплаты,
	|		ДоходыПоМесяцам.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|		ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
	|		ДоходыПоМесяцам.КодДохода КАК КодДоходаСсылка,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) КАК СуммаДохода,
	|		ДоходыПоМесяцам.КодВычета КАК КодВычетаСсылка,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0) КАК СуммаВычета,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0) КАК ОблагаемаяСуммаДохода,
	|		0 КАК НалогНачислено,
	|		ДоходыПоМесяцам.КодДоходаКодДляОтчетности КАК КодДохода,
	|		ДоходыПоМесяцам.КодВычетаКодДляОтчетности КАК КодВычета,
	|		ДоходыПоМесяцам.Ставка КАК Ставка,
	|		ДоходыПоМесяцам.НалоговаяБаза КАК НалоговаяБаза,
	|		ДоходыПоМесяцам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|		ДоходыПоМесяцам.Год КАК Год
	|	ИЗ
	|		ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыДоПолученияСтатусаРезидента КАК ДоходыДоПолученияСтатусаРезидента
	|			ПО ДоходыПоМесяцам.ГоловнаяОрганизация = ДоходыДоПолученияСтатусаРезидента.ГоловнаяОрганизация
	|				И ДоходыПоМесяцам.ФизическоеЛицо = ДоходыДоПолученияСтатусаРезидента.ФизическоеЛицо
	|				И ДоходыПоМесяцам.Год = ДоходыДоПолученияСтатусаРезидента.Год
	|				И ДоходыПоМесяцам.Месяц = ДоходыДоПолученияСтатусаРезидента.Месяц
	|				И ДоходыПоМесяцам.РегистрацияВНалоговомОргане = ДоходыДоПолученияСтатусаРезидента.РегистрацияВНалоговомОргане
	|				И ДоходыПоМесяцам.Ставка = ДоходыДоПолученияСтатусаРезидента.Ставка
	|				И ДоходыПоМесяцам.НалоговаяБаза = ДоходыДоПолученияСтатусаРезидента.НалоговаяБаза
	|	ГДЕ
	|		ДоходыПоМесяцам.ДоходРазделаПо13
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДоходыПоМесяцам.ГоловнаяОрганизация,
	|		ДоходыПоМесяцам.ФизическоеЛицо,
	|		ВЫБОР
	|			КОГДА ДоходыПоМесяцам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|				ТОГДА ""Раздел4_Ставка13""
	|			КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				ТОГДА ""Раздел4_Ставка30""
	|			ИНАЧЕ ""Раздел4_Ставка35_15_9""
	|		КОНЕЦ,
	|		ДоходыПоМесяцам.Месяц,
	|		0,
	|		0,
	|		0,
	|		ДоходыПоМесяцам.ДатаНачисления,
	|		ДоходыПоМесяцам.МесяцНачисления,
	|		ДоходыПоМесяцам.ДатаВыплаты,
	|		ДоходыПоМесяцам.ДатаПолученияДохода,
	|		ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента,
	|		ДоходыПоМесяцам.КодДохода,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0),
	|		ДоходыПоМесяцам.КодВычета,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0),
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0),
	|		ВЫБОР
	|			КОГДА ДоходыПоМесяцам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|				ТОГДА 0
	|			КОГДА НЕ ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента
	|				ТОГДА 0
	|			ИНАЧЕ (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * ДоходыПоМесяцам.СтавкаЧислом
	|		КОНЕЦ,
	|		ДоходыПоМесяцам.КодДоходаКодДляОтчетности,
	|		ДоходыПоМесяцам.КодВычетаКодДляОтчетности,
	|		ДоходыПоМесяцам.Ставка,
	|		ДоходыПоМесяцам.НалоговаяБаза,
	|		ДоходыПоМесяцам.РегистрацияВНалоговомОргане,
	|		ДоходыПоМесяцам.Год
	|	ИЗ
	|		ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	|	ГДЕ
	|		НЕ ДоходыПоМесяцам.ДоходРазделаПо13
	|		И НЕ ДоходыПоМесяцам.ДатаПолученияДоходаФиксирована) КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеНалоговыхБаз КАК ОписаниеНалоговыхБаз
	|		ПО Доходы.НалоговаяБаза = ОписаниеНалоговыхБаз.КатегорияДохода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
	|		ПО Доходы.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
	|			И Доходы.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
	|			И Доходы.Год = СотрудникиСПревышением.Год
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.ФизическоеЛицо,
	|	Доходы.ГоловнаяОрганизация,
	|	Доходы.Раздел,
	|	ВЫБОР
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаОбъединенияНалоговыхБаз
	|			ТОГДА &ОбъединеннаяНалоговаяБазаСтрокой
	|		ИНАЧЕ ОписаниеНалоговыхБаз.ПредставлениеНалоговойБазы
	|	КОНЕЦ,
	|	ОписаниеНалоговыхБаз.ПорядокНалоговойБазы,
	|	Доходы.МесяцНалоговогоПериода,
	|	Доходы.ДатаНачисления,
	|	Доходы.МесяцНачисления,
	|	Доходы.ДатаВыплаты,
	|	Доходы.ДатаПолученияДохода,
	|	Доходы.КодДоходаСсылка,
	|	Доходы.КодВычетаСсылка,
	|	Доходы.Ставка,
	|	Доходы.КодВычета,
	|	Доходы.РегистрацияВНалоговомОргане,
	|	Доходы.КодДохода,
	|	СотрудникиСПревышением.ФизическоеЛицо ЕСТЬ НЕ NULL 
	|
	|ИМЕЮЩИЕ
	|	(МАКСИМУМ(Доходы.СуммаДоходаДоРезидентства) <> 0
	|		ИЛИ МАКСИМУМ(Доходы.СуммаВычетаДоРезидентства) <> 0
	|		ИЛИ МАКСИМУМ(Доходы.ОблагаемаяСуммаДоходаДоРезидентства) <> 0
	|		ИЛИ СУММА(Доходы.СуммаДохода) <> 0
	|		ИЛИ СУММА(Доходы.СуммаВычета) <> 0
	|		ИЛИ СУММА(Доходы.ОблагаемаяСуммаДохода) <> 0
	|		ИЛИ СУММА(Доходы.НалогНачислено) <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоходыПоМесяцам.ГоловнаяОрганизация,
	|	ДоходыПоМесяцам.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|			ТОГДА ""Раздел4_Ставка30""
	|		ИНАЧЕ ""Раздел4_Ставка35_15_9""
	|	КОНЕЦ,
	|	ДоходыПоМесяцам.Месяц,
	|	0,
	|	0,
	|	0,
	|	ДоходыПоМесяцам.ДатаНачисления,
	|	ДоходыПоМесяцам.МесяцНачисления,
	|	ДоходыПоМесяцам.ДатаВыплаты,
	|	ДоходыПоМесяцам.ДатаПолученияДохода,
	|	ДоходыПоМесяцам.КодДохода,
	|	ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0),
	|	ДоходыПоМесяцам.КодВычета,
	|	ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0),
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента
	|			ТОГДА ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента
	|			ТОГДА (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * ДоходыПоМесяцам.СтавкаЧислом
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДоходыПоМесяцам.КодДоходаКодДляОтчетности,
	|	ДоходыПоМесяцам.КодВычетаКодДляОтчетности,
	|	ДоходыПоМесяцам.Ставка,
	|	"""",
	|	99,
	|	ДоходыПоМесяцам.РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ДоходыПоМесяцам.СуммаДохода
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА ДоходыПоМесяцам.СуммаДохода
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ЛОЖЬ
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	|ГДЕ
	|	НЕ ДоходыПоМесяцам.ДоходРазделаПо13
	|	И ДоходыПоМесяцам.ДатаПолученияДоходаФиксирована
	|	И ДоходыПоМесяцам.СуммаДохода <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Раздел,
	|	ОписаниеНалоговыхБаз.ПорядокНалоговойБазы,
	|	МесяцНалоговогоПериода,
	|	МесяцНачисления,
	|	ДатаНачисления,
	|	ДатаВыплаты,
	|	КодДохода,
	|	КодВычета
	|ИТОГИ
	|	МАКСИМУМ(СуммаДоходаДоРезидентства),
	|	МАКСИМУМ(СуммаВычетаДоРезидентства),
	|	МАКСИМУМ(ОблагаемаяСуммаДоходаДоРезидентства),
	|	СУММА(СуммаДохода),
	|	СУММА(СуммаВычета),
	|	СУММА(ОблагаемаяСуммаДохода),
	|	МАКСИМУМ(НалогНачислено),
	|	СУММА(СуммаДохода13),
	|	СУММА(СуммаДохода15),
	|	МАКСИМУМ(ЭтоФизическоеЛицоСПревышением)
	|ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Раздел,
	|	НалоговаяБаза,
	|	МесяцНалоговогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыПоСтавкам.Месяц КАК Месяц,
	|	ВычетыПоСтавкам.МесяцПериодаПредоставленияВычета КАК МесяцПериодаПредоставленияВычета,
	|	ВычетыПоСтавкам.КодВычета КАК КодВычетаСсылка,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	|	МАКСИМУМ(ЕСТЬNULL(ДоходыПоМесяцамПоСтавке13Итог.СуммаДохода, 0)) КАК СуммаДохода,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычета,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоМесяцамПоСтавке13Итог КАК ДоходыПоМесяцамПоСтавке13Итог
	|		ПО (ДоходыПоМесяцамПоСтавке13Итог.ГоловнаяОрганизация = ВычетыПоСтавкам.ГоловнаяОрганизация)
	|			И (ДоходыПоМесяцамПоСтавке13Итог.ФизическоеЛицо = ВычетыПоСтавкам.ФизическоеЛицо)
	|			И (ДоходыПоМесяцамПоСтавке13Итог.Месяц = ВычетыПоСтавкам.Месяц)
	|			И (ДоходыПоМесяцамПоСтавке13Итог.РегистрацияВНалоговомОргане = ВычетыПоСтавкам.РегистрацияВНалоговомОргане)
	|			И (ВычетыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.КодВычета,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности,
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо,
	|	ВычетыПоСтавкам.Месяц,
	|	ВычетыПоСтавкам.МесяцПериодаПредоставленияВычета,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Месяц,
	|	МесяцПериодаПредоставленияВычета,
	|	КодВычета
	|ИТОГИ
	|	СУММА(СуммаВычета),
	|	МАКСИМУМ(СуммаДохода)
	|ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	СУММА(ДанныеОНалогах.НалогНачислено) КАК НалогНачислено,
	|	СУММА(ДанныеОНалогах.НалогКЗачету) КАК НалогКЗачету,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.СтавкаПоИтогамГода КАК СтавкаПоИтогамГода
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц,
	|	ДанныеОНалогах.Период,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.СтавкаПоИтогамГода,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеОНалогах.НалогНачислено) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Период < &ДатаНачалаРасчетаСроковУплатыНалога
	|			ТОГДА ДанныеОНалогах.Период
	|		ИНАЧЕ ДанныеОНалогах.СрокПеречисления
	|	КОНЕЦ КАК СрокПеречисления,
	|	СУММА(ДанныеОНалогах.НалогУдержано) КАК НалогУдержано,
	|	СУММА(ДанныеОНалогах.УдержаноКЗачетуПоСтавке13) КАК КЗачетуПоСтавке13,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогУдержано <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц,
	|	ДанныеОНалогах.Период,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Период < &ДатаНачалаРасчетаСроковУплатыНалога
	|			ТОГДА ДанныеОНалогах.Период
	|		ИНАЧЕ ДанныеОНалогах.СрокПеречисления
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Месяц,
	|	Дата,
	|	Ставка,
	|	СрокПеречисления
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.НалогВозвращено КАК НалогВозвращено,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогВозвращено <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.НалогПереданоНаВзыскание КАК НалогПереданоНаВзыскание,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогПереданоНаВзыскание <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК Месяц,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период КАК Дата,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка КАК Ставка,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма КАК Сумма,
	|	ЕСТЬNULL(ПеречисленоДоПолученияСтатусаРезидента.КЗачетуПоСтавке13, 0) КАК КЗачетуПоСтавке13,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РеквизитыПП КАК РеквизитыПП,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПерваяСтрокаПеречисленногоНалогаЗаМесяц КАК ПерваяСтрокаПеречисленногоНалогаЗаМесяц
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКЗачетуПоПеречислениям КАК ПеречисленоДоПолученияСтатусаРезидента
	|			ПО ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ГоловнаяОрганизация = ПеречисленоДоПолученияСтатусаРезидента.ГоловнаяОрганизация
	|				И ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ФизическоеЛицо = ПеречисленоДоПолученияСтатусаРезидента.ФизическоеЛицо
	|				И ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Месяц = ПеречисленоДоПолученияСтатусаРезидента.МесяцНалоговогоПериода
	|				И ПерваяСтрокаПеречисленногоНалогаЗаМесяц.РегистрацияВНалоговомОргане = ПеречисленоДоПолученияСтатусаРезидента.РегистрацияВНалоговомОргане
	|				И (ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
	|		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ГоловнаяОрганизация = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ГоловнаяОрганизация
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ФизическоеЛицо
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Месяц
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Ставка
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.РегистрацияВНалоговомОргане
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычета,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	КодВычета
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДоходыПоСтавкам.СтавкаЧислом КАК СтавкаЧислом,
	|	ВТДоходыПоСтавкам.Ставка КАК Ставка,
	|	ВТДоходыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВТДоходыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВТДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТДоходыПоСтавкам.Год КАК Год,
	|	ВТДоходыПоСтавкам.Месяц КАК Месяц,
	|	ВТДоходыПоСтавкам.СуммаДохода КАК СуммаДохода,
	|	ВТДоходыПоСтавкам.СуммаВычета КАК СуммаВычета,
	|	ВТДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
	|	ВТДоходыПоСтавкам.КодДохода КАК КодДохода,
	|	ВТДоходыПоСтавкам.КодДоходаКод КАК КодДоходаКод,
	|	ВТДоходыПоСтавкам.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
	|	ВТДоходыПоСтавкам.МесяцНачисления КАК МесяцНачисления,
	|	ВТДоходыПоСтавкам.ДатаВыплаты КАК ДатаВыплаты,
	|	ВТДоходыПоСтавкам.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	ВТДоходыПоСтавкам.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
	|	ВТДоходыПоСтавкам.ДатаНачисления КАК ДатаНачисления,
	|	ВТДоходыПоСтавкам.КодВычета КАК КодВычета,
	|	ВТДоходыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
	|	ВТДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
	|	ВТДоходыПоСтавкам.ДоходРазделаПо13 КАК ДоходРазделаПо13
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ВТДоходыПоСтавкам		";
	
	
	RSN_ОбщегоНазначенияНаСервере.СохранитьЗапрос(Запрос);
	
	Результат = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = Результат.Количество();
	
	ТаблицаРегистрацийВНО = Результат[КоличествоРезультатов - 15].Выгрузить();
	ТаблицаРегистрацийВНО.Колонки.Добавить("ОКАТО_КПП", Новый ОписаниеТипов("Строка"));
	ТаблицаРегистрацийВНО.Колонки.Добавить("ОКТМО_КПП", Новый ОписаниеТипов("Строка"));
	ТаблицаРегистрацийВНО.Индексы.Добавить("РегистрацияВНалоговомОргане");
	//Для каждого СтрокаТЗ Из ТаблицаРегистрацийВНО Цикл
	//	СтрокаТЗ.ОКАТО_КПП = УчетНДФЛ.СуммаОКАТОиКПП(СтрокаТЗ.КодПоОКАТО, СтрокаТЗ.КПП);
	//	СтрокаТЗ.ОКТМО_КПП = УчетНДФЛ.СуммаОКАТОиКПП(СтрокаТЗ.КодПоОКТМО, СтрокаТЗ.КПП);
	//КонецЦикла;
	
	ТЗНДФЛ = Результат[16].Выгрузить(); 
	
	Возврат  ТЗНДФЛ;
	
	//ВыборкаАвансыЗачтенныеИтоги		= Результат[КоличествоРезультатов - 16].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаВычетовПоСтавке13		= Результат[КоличествоРезультатов - 14].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	//ВыборкаСтатусов					= Результат[КоличествоРезультатов - 13].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаУведомления				= Результат[КоличествоРезультатов - 12].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	//ВыборкаСправкиНДФЛ				= Результат[КоличествоРезультатов - 11].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	//ВыборкаСтандартныеВычеты		= Результат[КоличествоРезультатов - 10].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаСоциальныеВычеты			= Результат[КоличествоРезультатов - 9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаДоходовПоМесяцамПоРазделам = Результат[КоличествоРезультатов - 8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаВычетыПоМесяцамПоВидам   = Результат[КоличествоРезультатов - 7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаНалогиНачисленныеИтоги   = Результат[КоличествоРезультатов - 6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаНалогиУдержанныеИтоги    = Результат[КоличествоРезультатов - 5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаНалогиВозвращенныеИтоги  = Результат[КоличествоРезультатов - 4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаНалогиВзысканиеИтоги     = Результат[КоличествоРезультатов - 3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаНалогиПеречисленныеИтоги = Результат[КоличествоРезультатов - 2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаВычетыИтоги				= Результат[КоличествоРезультатов - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
Конецфункции

  
	