#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИнвертироватьИспользованиеРегламентныхЗаданий(Команда)
	ИнвертироватьИспользованиеРегламентныхЗаданийНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнвертироватьИспользованиеРегламентныхЗаданийНаСервере()
	Для каждого ВыделеннаяСтрока Из Элементы.ТаблицаРегламентныеЗадания.ВыделенныеСтроки Цикл
		ТекущиеДанные = ТаблицаРегламентныеЗадания.НайтиПоИдентификатору(ВыделеннаяСтрока);
		НовоеИспользование = НЕ ТекущиеДанные.Использование;
		РегламентныеЗаданияСервер.ИзменитьРегламентноеЗадание(
			ТекущиеДанные.Идентификатор, Новый Структура("Использование", НовоеИспользование));
		ТекущиеДанные.Использование = НовоеИспользование;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
