
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьСвойстваДС();
КонецПроцедуры       

&НаСервере
Процедура УстановитьСвойстваДС()    
	СвойстваДинамическогоСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка(); 
	СвойстваДинамическогоСписка.ТекстЗапроса = "ВЫБРАТЬ
	|	ВыполненныеРассылки.Объект КАК Объект,
	|	ВыполненныеРассылки.Рассылка КАК Рассылка
	|ПОМЕСТИТЬ ВТ_Рассылка
	|ИЗ
	|	РегистрСведений.RSN_ВыполненныеРассылки КАК ВыполненныеРассылки
	|СГРУППИРОВАТЬ ПО
	|	ВыполненныеРассылки.Объект,
	|	ВыполненныеРассылки.Рассылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрСведенийНовыеCотрудники.СотрудникСтрока КАК СотрудникСтрока,
	|	РегистрСведенийНовыеCотрудники.Сотрудник КАК Сотрудник,
	|	РегистрСведенийНовыеCотрудники.ДатаВыхода КАК ДатаВыхода,
	|	РегистрСведенийНовыеCотрудники.ActualDepartmentName КАК ActualDepartmentName,
	|	РегистрСведенийНовыеCотрудники.Desk_Team КАК Desk_Team,
	|	РегистрСведенийНовыеCотрудники.ActualPositionTitle КАК ActualPositionTitle,
	|	РегистрСведенийНовыеCотрудники.ДолжностьСтрокой КАК ДолжностьСтрокой,
	|	РегистрСведенийНовыеCотрудники.Руководитель КАК Руководитель,
	|	РегистрСведенийНовыеCотрудники.Валюта КАК Валюта,
	|	РегистрСведенийНовыеCотрудники.Юр_Лицо КАК Юр_Лицо,
	|	РегистрСведенийНовыеCотрудники.Спеллинг КАК Спеллинг,
	|	РегистрСведенийНовыеCотрудники.ДоходАгенства КАК ДоходАгенства,
	|	РегистрСведенийНовыеCотрудники.Агенство КАК Агенство,
	|	РегистрСведенийНовыеCотрудники.Офис КАК Офис,
	|	РегистрСведенийНовыеCотрудники.НомерМеста КАК НомерМеста,
	|	РегистрСведенийНовыеCотрудники.ОрганизоватьРабочееМесто КАК ОрганизоватьРабочееМесто,
	|	РегистрСведенийНовыеCотрудники.СоздатьАккаунт КАК СоздатьАккаунт,
	|	РегистрСведенийНовыеCотрудники.Пропуск КАК Пропуск,
	|	РегистрСведенийНовыеCотрудники.МобильныйТелефон КАК МобильныйТелефон,
	|	РегистрСведенийНовыеCотрудники.КомментарийДляИТ КАК КомментарийДляИТ,
	|	РегистрСведенийНовыеCотрудники.НеСогл КАК НеСогл,
	|	РегистрСведенийНовыеCотрудники.Перевод КАК Перевод,
	|	РегистрСведенийНовыеCотрудники.Увольнение КАК Увольнение,
	|	РегистрСведенийНовыеCотрудники.ОтменаВыхода КАК ОтменаВыхода,
	|	РегистрСведенийНовыеCотрудники.УдаленнаяРабота КАК УдаленнаяРабота,
	|	РегистрСведенийНовыеCотрудники.Город КАК Город,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Рассылка.Объект, 0) <> 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Состояние,
	|	РегистрСведенийНовыеCотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ZUPC_НовыеCотрудники КАК РегистрСведенийНовыеCотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Рассылка КАК ВТ_Рассылка
	|		ПО РегистрСведенийНовыеCотрудники.СотрудникСтрока = ВТ_Рассылка.Объект";   
	СвойстваДинамическогоСписка.ОсновнаяТаблица = "РегистрСведений.ZUPC_НовыеCотрудники";
	Список.ПроизвольныйЗапрос = Истина;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваДинамическогоСписка);

КонецПроцедуры

