
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование"	, Метаданные().Синоним);
	РегистрационныеДанные.Вставить("Информация"		, Метаданные().Комментарий);
	РегистрационныеДанные.Вставить("Версия"			, "1.1");
	
	// В безопасном режиме:
	// - игнорируется привилегированный режим;
	// - запрещены внешние по отношению к платформе 1С:Предприятия действия: 
	// 		- COM; 
	//		- Загрузка внешних компонент; 
	//		- Запуск внешних приложений и команд операционной системы; 
	//		- Доступ к файловой системе, кроме временных файлов; 
	//		- Доступ к интернет.
	// Платформа обеспечивает равенство значений счетчика безопасного режима при вызове произвольного метода встроенного языка и после возврата из него.
	
	РегистрационныеДанные.Вставить("БезопасныйРежим", Истина);
	
	//ДополнительнаяОбработка
	//ДополнительныйОтчет
	//ЗаполнениеОбъекта
	//Отчет
	//ПечатнаяФорма
	//СозданиеСвязанныхОбъектов
	РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
	
	// Команды.
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	
	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = "1";
	строкаКоманды.Использование = "ОткрытиеФормы";
	строкаКоманды.Представление = "Зарплата Net";
	
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
	
	Возврат РегистрационныеДанные;
	
КонецФункции
