
Функция СотрудникПоЭлектроннойПочте(ЭлектроннаяПочта) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ZUPC_НовыеCотрудники.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ZUPC_НовыеCотрудники КАК ZUPC_НовыеCотрудники
		|ГДЕ
		|	ZUPC_НовыеCотрудники.ЭлектроннаяПочта = &ЭлектроннаяПочта
		|	И НЕ ZUPC_НовыеCотрудники.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ЭлектроннаяПочта", ЭлектроннаяПочта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ВызватьИсключение СтрШаблон(
			"Для электронной почты '%1' не найден сотрудник.", ЭлектроннаяПочта);	
	КонецЕсли;
	Если Выборка.Количество() > 1 Тогда
		ВызватьИсключение СтрШаблон(
			"Для электронной почты '%1' найдено более одного сотрудника.", ЭлектроннаяПочта);	
	КонецЕсли; 
	Выборка.Следующий();
    Возврат Выборка.Сотрудник;	
КонецФункции
