
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

СтандартнаяОбработка = Ложь;	
	
МВТ = Новый МенеджерВременныхТаблиц;

Период = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Значение;

Если КонецМесяца(Период.ДатаНачала) <> Период.ДатаОкончания Тогда 
	Период.ДатаОкончания = КонецМесяца(Период.ДатаНачала);
	ОбщегоНазначения.СообщитьПользователю("Изменена дата кончания периода. Отчет может формироваться только помесячно");
КонецЕсли;

Организация = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение;
ПодготовитьВременныеТаблицыДляОтчета(МВТ, Организация ,Период);

КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки,, Тип("ГенераторМакетаКомпоновкиДанных"));

// Здесь его используем
ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;

ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,, ДанныеРасшифровки, Истина,,МВТ);

ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

Процедура ПодготовитьВременныеТаблицыДляОтчета(МВТ,Организация ,Период)
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.Организация = Организация;
	
	РаботающиеСотрудникиНаДату(МВТ, Период.ДатаНачала,    "ВТРаботающиеСотрудникиНачалоПериода",ПараметрыПолучения);	
	РаботающиеСотрудникиНаДату(МВТ, Период.ДатаОкончания, "ВТРаботающиеСотрудникиКонецПериода", ПараметрыПолучения);
	РаботающиеСотрудникиНаДату(МВТ, НачалоГода(Период.ДатаНачала), "ВТРаботающиеСотрудникиНачалоГода", ПараметрыПолучения);
		
	СобытиеПрием = Перечисления.ВидыКадровыхСобытий.Прием;
	СобытиеУвольнение = Перечисления.ВидыКадровыхСобытий.Увольнение;
	
	КадровыеСобытияЗаПериод(МВТ, Период.ДатаНачала, Период.ДатаОкончания, СобытиеПрием, "ВТПринятыеЗаМесяц",ПараметрыПолучения);
	КадровыеСобытияЗаПериод(МВТ, Период.ДатаНачала, Период.ДатаОкончания, СобытиеУвольнение, "ВТУволенныеЗаМесяц",ПараметрыПолучения);   	
	КадровыеСобытияЗаПериод(МВТ, НачалоГода(Период.ДатаНачала), Период.ДатаОкончания, СобытиеПрием, "ВТПринятыеСНачалаГода",ПараметрыПолучения);
	КадровыеСобытияЗаПериод(МВТ, НачалоГода(Период.ДатаНачала), Период.ДатаОкончания, СобытиеУвольнение, "ВТУволенныеСНачалаГода",ПараметрыПолучения); 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТРаботающиеСотрудникиНачалоПериода.Сотрудник) КАК РаботающиеНаНачалоМесяца,
	               |	0 КАК РаботающиеНаКонецМесяца,
	               |	0 КАК РаботающиеНаНачалоГода,
	               |	0 КАК ПринятыеЗаМесяц,
	               |	0 КАК УволенныеЗаМесяц,
	               |	0 КАК ПринятыеСНачалаГода,
	               |	0 КАК УволенныеСНачалаГода,
	               |	0 КАК УволенныеПоСобственномуЖеланию,
	               |	0 КАК УволенныеПоИнициативеРаботодателя
	               |ПОМЕСТИТЬ ВТДанные
	               |ИЗ
	               |	ВТРаботающиеСотрудникиНачалоПериода КАК ВТРаботающиеСотрудникиНачалоПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТРаботающиеСотрудникиКонецПериода.Сотрудник),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	ВТРаботающиеСотрудникиКонецПериода КАК ВТРаботающиеСотрудникиКонецПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТРаботающиеСотрудникиНачалоГода.Сотрудник),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	ВТРаботающиеСотрудникиНачалоГода КАК ВТРаботающиеСотрудникиНачалоГода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	0,
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТПринятыеЗаМесяц.Сотрудник),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	ВТПринятыеЗаМесяц КАК ВТПринятыеЗаМесяц
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТУволенныеЗаМесяц.Сотрудник),
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	ВТУволенныеЗаМесяц КАК ВТУволенныеЗаМесяц
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТПринятыеСНачалаГода.Сотрудник),
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	ВТПринятыеСНачалаГода КАК ВТПринятыеСНачалаГода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТУволенныеСНачалаГода.Сотрудник),
	               |	0,
	               |	0
	               |ИЗ
	               |	ВТУволенныеСНачалаГода КАК ВТУволенныеСНачалаГода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТУволенныеСНачалаГода.Сотрудник),
	               |	0
	               |ИЗ
	               |	ВТУволенныеСНачалаГода КАК ВТУволенныеСНачалаГода
	               |ГДЕ
	               |	ВТУволенныеСНачалаГода.ПриказОбУвольнении.ZUPC_ReasonForTermination = ЗНАЧЕНИЕ(Перечисление.ZUPC_ReasonForTermination.ZUPCResignedAtTheirOwnWill)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТУволенныеСНачалаГода.Сотрудник)
	               |ИЗ
	               |	ВТУволенныеСНачалаГода КАК ВТУволенныеСНачалаГода
	               |ГДЕ
	               |	ВТУволенныеСНачалаГода.ПриказОбУвольнении.ZUPC_ReasonForTermination = ЗНАЧЕНИЕ(Перечисление.ZUPC_ReasonForTermination.ZUPC_ResignedAsCoInitiative)

	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТДанные.РаботающиеНаНачалоМесяца) КАК РаботающиеНаНачалоМесяца,
	               |	СУММА(ВТДанные.РаботающиеНаКонецМесяца) КАК РаботающиеНаКонецМесяца,
	               |	СУММА(ВТДанные.РаботающиеНаНачалоГода) КАК РаботающиеНаНачалоГода,
	               |	СУММА(ВТДанные.ПринятыеЗаМесяц) КАК ПринятыеЗаМесяц,
	               |	СУММА(ВТДанные.УволенныеЗаМесяц) КАК УволенныеЗаМесяц,
	               |	СУММА(ВТДанные.ПринятыеСНачалаГода) КАК ПринятыеСНачалаГода,
	               |	СУММА(ВТДанные.УволенныеСНачалаГода) КАК УволенныеСНачалаГода,
	               |	СУММА(ВТДанные.УволенныеПоСобственномуЖеланию) КАК УволенныеПоСобственномуЖеланию,
	               |	СУММА(ВТДанные.УволенныеПоИнициативеРаботодателя) КАК УволенныеПоИнициативеРаботодателя
	               |ПОМЕСТИТЬ ВТДанныеДляРасчетаЧисленности
	               |ИЗ
	               |	ВТДанные КАК ВТДанные"; 
	
	    Запрос.Выполнить();
	
КонецПроцедуры	

Процедура РаботающиеСотрудникиНаДату(МВТ,ДатаСведений, ИмяВременнойТаблицы, Знач ПараметрыПолучения)
	
ПараметрыПолучения.НачалоПериода = ДатаСведений;
ПараметрыПолучения.ОкончаниеПериода = ДатаСведений;
	
КадровыйУчет.СоздатьВТСотрудникиОрганизации(МВТ , Истина, ПараметрыПолучения,ИмяВременнойТаблицы);
	
КонецПроцедуры	

Процедура КадровыеСобытияЗаПериод(МВТ,НачалоПериода, ОкончанияПериода, КадровоеСобытие, ИмяВременнойТаблицы, Знач ПараметрыПолучения)
	
	ПараметрыПолучения.Отборы = Новый Массив();
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы,"ВидСобытия", "=",КадровоеСобытие);
	
	Если КадровоеСобытие = Перечисления.ВидыКадровыхСобытий.Прием Тогда	
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы,"ДатаПриема", ">=",НачалоПериода);
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы,"ДатаПриема", "<=",ОкончанияПериода);
	Иначе
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы,"ДатаУвольнения", ">=",НачалоПериода);
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы,"ДатаУвольнения", "<=",ОкончанияПериода);	
	КонецЕсли;	
	
	ПараметрыПолучения.КадровыеДанные = "ДатаПриема, ДатаУвольнения, ВидСобытия, ПриказОбУвольнении";

	ПараметрыПолучения.НачалоПериода = НачалоПериода;
    ПараметрыПолучения.ОкончаниеПериода = ОкончанияПериода;

	КадровыйУчет.СоздатьВТСотрудникиОрганизации(МВТ , Истина, ПараметрыПолучения,ИмяВременнойТаблицы);

КонецПроцедуры

