Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации				= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	ПараметрыРегистрации.Вид			= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия			= "1.2.2";
	ПараметрыРегистрации.БезопасныйРежим= Ложь;
	ПараметрыРегистрации.Наименование	= "ЗакрытиеОстатковПоЗП";
	ПараметрыРегистрации.Информация		= "";
	
	НоваяКоманда				= ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление	= НСтр("ru = 'Закрытие остатков по ЗП'");
	НоваяКоманда.Идентификатор	= "ЗакрытиеОстатковПоЗП";
	НоваяКоманда.Использование	= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Истина;
	
	
	Возврат ПараметрыРегистрации;
	
КонецФункции