
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Фамилия") Тогда 
		
		Список.Параметры.УстановитьЗначениеПараметра("СотрудникСтрока","%"+Параметры.Фамилия+"%");	
		
	КонецЕсли;
	

КонецПроцедуры


&НаСервере
Функция ЗапихнутьВХранилище(Значение)
	Возврат	ПоместитьВоВременноеХранилище(Значение,УникальныйИдентификатор);
КонецФункции // ()

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Адрес = ЗапихнутьВХранилище(Значение);
	ОповеститьОВыборе(Адрес);  
	
КонецПроцедуры
