
&НаКлиенте
Процедура ВыбратьКартинку(Команда)
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("НачатьВыборФайла", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт 
	
	СсылкаНаКартуОфиса = Адрес;
	
КонецПроцедуры              



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СсылкаНаКартуОфиса = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"КартаОфиса"); 

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Попытка
		Если ЗначениеЗаполнено(СсылкаНаКартуОфиса) Тогда
			ХЩ = ПолучитьИзВременногоХранилища(СсылкаНаКартуОфиса);
			ТекущийОбъект.КартаОфиса =  Новый ХранилищеЗначения(ХЩ);
		КонецЕсли;
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
КонецПроцедуры

