
//&Вместо("УдалитьОбъект")
//Процедура ЦЗ_УдалитьОбъект(Объект, УдалитьНепосредственно, ИмяТипа)

//	МетаданныеОбъекта = Объект.Метаданные();
//	
//	Если ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта)
//		Или ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеОбъекта)
//		Или ОбщегоНазначения.ЭтоПланСчетов(МетаданныеОбъекта)
//		Или ОбщегоНазначения.ЭтоПланВидовРасчета(МетаданныеОбъекта) Тогда
//		
//		Предопределенный = Объект.Предопределенный;
//	Иначе
//		Предопределенный = Ложь;
//	КонецЕсли;
//	
//	Если Предопределенный Тогда
//		
//		Возврат;
//		
//	КонецЕсли;
//	
//	Если УдалитьНепосредственно Тогда
//		
//		Комментарий = "Попытка выполнить непосредственное удаление! " + Объект.Ссылка.УникальныйИдентификатор();
//		ЗаписьЖурналаРегистрацииОбменДанными(Комментарий, УровеньЖурналаРегистрации.Предупреждение);
//		
//		//Объект.Удалить();    
//		//нужна проверка на битую ссылку
//		
//		
//		УстановитьПометкуУдаленияУОбъекта(Объект, Истина, ИмяТипа);
//		
//	Иначе
//		
//		УстановитьПометкуУдаленияУОбъекта(Объект, Истина, ИмяТипа);
//		
//	КонецЕсли; 
//	
//КонецПроцедуры
