&НаКлиенте
Процедура Выполнить1(Команда)
	//
	//Если  НЕ Объект.Организация = Объект.Документ.Организация Тогда
	//	Сообщить("Не совпадает организация с организацией указанной в документе");
	//	Возврат;
	//КонецЕсли;	
	//Если Объект.Документ = Документы.ПереносДанных.ПустаяСсылка() Тогда

	//КонецЕсли;
	
	Для Каждого Стр Из Организации Цикл
		КоличСтр = Организации.НайтиСтроки(Новый Структура("Организация",	Стр.Организация)).Количество();
		Если НЕ КоличСтр = 1 Тогда
			Сообщить("В табличной части "+КоличСтр+" строк(и) по организации " + Стр.Организация);
			Сообщить("Обработка прервана!", СтатусСообщения.Важное);
			Возврат
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Стр Из Организации Цикл
		Если НЕ Стр.Выполнить Тогда
			Стр.Комментарий = "пропущено";
			Продолжить;
		КонецЕсли;
		
		Орг = Стр.Организация;
		Док = Стр.Документ;
		Комментарий = "";
		СтрокаОбработана = ВыполнитьНаСервере(Орг,Док,Комментарий);
		
		Стр.Документ = Док;
		Стр.Комментарий = Комментарий;
		Стр.Выполнить = НЕ СтрокаОбработана;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ВыполнитьНаСервере(Орг,Док,Комментарий="")
	Если  Орг = Справочники.Организации.ПустаяСсылка() Тогда
		Сообщить("Не указана организация");
		Возврат Ложь;
	КонецЕсли;	
	Если  Док = Документы.ПереносДанных.ПустаяСсылка() Тогда
		Док = Документы.ПереносДанных.СоздатьДокумент();
		Док.ПериодРегистрации = Объект.ПериодРегистрации;
		Док.Дата = КонецМесяца(Объект.ПериодРегистрации);
		Док.Организация = Орг;
		Док.Номер = "ЗакрОст";
		Если Объект.ЗакрыватьЗарплатуКВыплате Тогда
			Регистр = Док.ТаблицаРегистров.Добавить();
			Регистр.Имя = "ЗарплатаКВыплате";
		КонецЕсли;	
		Если Объект.ЗакрыватьВзаиморасчетыССотрудниками Тогда
			Регистр = Док.ТаблицаРегистров.Добавить();
			Регистр.Имя = "ВзаиморасчетыССотрудниками";
		КонецЕсли;
		Если Объект.ЗакрыватьБухгалтерскиеВзаиморасчетыССотрудниками Тогда
			Регистр = Док.ТаблицаРегистров.Добавить();
			Регистр.Имя = "БухгалтерскиеВзаиморасчетыССотрудниками";
		КонецЕсли;
		Если Объект.ЗакрыватьРасчетыНалогоплательщиковСБюджетомПоНДФЛ Тогда
			Регистр = Док.ТаблицаРегистров.Добавить();
			Регистр.Имя = "РасчетыНалогоплательщиковСБюджетомПоНДФЛ";
		КонецЕсли;
		Если Объект.ЗакрыватьРасчетыНалоговыхАгентовСБюджетомПоНДФЛ Тогда
			Регистр = Док.ТаблицаРегистров.Добавить();
			Регистр.Имя = "ЗакрыватьРасчетыНалоговыхАгентовСБюджетомПоНДФЛ";
		КонецЕсли;
	Иначе
		Если  НЕ Орг = Док.Организация Тогда
			Комментарий = "Не совпадает организация с организацией указанной в документе"+Док.Организация;
			Сообщить("Не совпадает организация "+Орг+" с организацией указанной в документе"+Док.Организация);
			Возврат Ложь;
		КонецЕсли;	
		Если  НЕ Объект.ПериодРегистрации = Док.ПериодРегистрации Тогда
			Комментарий = "Не совпадает ПериодРегистрации "+Орг+" с периодом указанным в документе"+Док.ПериодРегистрации;
			Сообщить("Не совпадает ПериодРегистрации с периодом указанным в документе"+Док.ПериодРегистрации);
			Возврат Ложь;
		КонецЕсли;	
		Если  НЕ Лев(Док.Номер,7) = "ЗакрОст" Тогда
			Комментарий = "Номер указанный в документе "+Док.Номер+ " должен начинаться с ""ЗакрОст""";
			Сообщить("Для "+Орг+" номер указанный в документе "+Док.Номер+ " должен начинаться с ""ЗакрОст""");
			Возврат Ложь;
		КонецЕсли;	
		
		Док = Док.ПолучитьОбъект();
		//Док.Дата = КонецМесяца(Объект.ПериодРегистрации);
		//Очистим регистры
		Если Объект.ЗакрыватьЗарплатуКВыплате И НЕ Док.Движения.Найти("ЗарплатаКВыплате")=Неопределено Тогда
			Движение = Док.Движения.ЗарплатаКВыплате;	
			Движение.Прочитать();	
			Движение.Очистить();	
			Движение.Записать();
		КонецЕсли;	
		Если Объект.ЗакрыватьВзаиморасчетыССотрудниками И НЕ Док.Движения.Найти("ВзаиморасчетыССотрудниками")=Неопределено Тогда
			Движение = Док.Движения.ВзаиморасчетыССотрудниками;	
			Движение.Прочитать();	
			Движение.Очистить();	
			Движение.Записать();
		КонецЕсли;
		Если Объект.ЗакрыватьБухгалтерскиеВзаиморасчетыССотрудниками И НЕ Док.Движения.Найти("БухгалтерскиеВзаиморасчетыССотрудниками")=Неопределено Тогда
			Движение = Док.Движения.БухгалтерскиеВзаиморасчетыССотрудниками;	
			Движение.Прочитать();	
			Движение.Очистить();	
			Движение.Записать();
		КонецЕсли;
		Если Объект.ЗакрыватьРасчетыНалоговыхАгентовСБюджетомПоНДФЛ И НЕ Док.Движения.Найти("РасчетыНалоговыхАгентовСБюджетомПоНДФЛ")=Неопределено Тогда
			Движение = Док.Движения.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ;	
			Движение.Прочитать();	
			Движение.Очистить();	
			Движение.Записать();
		КонецЕсли;
		Если Объект.ЗакрыватьРасчетыНалогоплательщиковСБюджетомПоНДФЛ И НЕ Док.Движения.Найти("РасчетыНалогоплательщиковСБюджетомПоНДФЛ")=Неопределено Тогда
			Движение = Док.Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ;	
			Движение.Прочитать();	
			Движение.Очистить();	
			Движение.Записать();
		КонецЕсли;
	КонецЕсли;	
	Док.Записать();
	
	Если Объект.ЗакрыватьЗарплатуКВыплате Тогда
		ЗакрытьЗПКВыплате(Орг,Док);
	КонецЕсли;	
	
	Если Объект.ЗакрыватьВзаиморасчетыССотрудниками Тогда
		ЗакрытьВзаиморасчеты(Орг,Док);
	КонецЕсли;
	
	Если Объект.ЗакрыватьБухгалтерскиеВзаиморасчетыССотрудниками Тогда
		ЗакрытьБухгалтерискиеВзаиморасчеты(Орг,Док, Ложь);
	КонецЕсли;
	
	Если Объект.СкопироватьВзаиморасчетыВБухгалтерскиеВзаиморасчеты Тогда
		ЗакрытьБухгалтерискиеВзаиморасчеты(Орг,Док, Истина)
	КонецЕсли;
	
	Если Объект.ЗакрыватьРасчетыНалоговыхАгентовСБюджетомПоНДФЛ Тогда
		ЗакрытьРасчетыНалоговыхАгентовСБюджетомПоНДФЛ(Орг,Док);
	КонецЕсли;
	
	Если Объект.ЗакрыватьРасчетыНалогоплательщиковСБюджетомПоНДФЛ Тогда
		ЗакрытьРасчетыНалогоплательщиковСБюджетомПоНДФЛ(Орг,Док);
	КонецЕсли;
	Комментарий = "Обработано " + ТекущаяДата();
	Док = Док.Ссылка;
	Возврат Истина;
КонецФункции

Процедура ЗакрытьЗПКВыплате(Орг,Док) 
	
	
	Дата = Док.ПериодРегистрации;
	
	Если Док.ТаблицаРегистров.Найти("ЗарплатаКВыплате", "Имя") = Неопределено Тогда
		НоваяСтрока = Док.ТаблицаРегистров.Добавить();
		НоваяСтрока.Имя = "ЗарплатаКВыплате";
		//НоваяСтрока.Представление = "Зарплата к выплате";
		
		Док.ТаблицаРегистров.Сортировать("Имя ВОЗР");
	КонецЕсли;
	
	НаборТекущегоОбъекта2 = Док.Движения["ЗарплатаКВыплате"];
	НаборТекущегоОбъекта2.Очистить();
	Док.Записать();
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("Дата",				КонецМесяца(Дата) + 1);
	Запрос.УстановитьПараметр("Орг",				Орг);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗарплатаКВыплатеОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗарплатаКВыплатеОстатки.Сотрудник КАК Сотрудник,
	|	ЗарплатаКВыплатеОстатки.Подразделение КАК Подразделение,
	|	ЗарплатаКВыплатеОстатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток КАК СуммаКВыплатеОстаток,
	|	ЗарплатаКВыплатеОстатки.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ЗарплатаКВыплатеОстатки.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗарплатаКВыплатеОстатки.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	ЗарплатаКВыплатеОстатки.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Остатки(&Дата, Организация = &Орг) КАК ЗарплатаКВыплатеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплатеОстатки.Сотрудник,
	|	ЗарплатаКВыплатеОстатки.ФизическоеЛицо,
	|	ЗарплатаКВыплатеОстатки.Подразделение,
	|	ЗарплатаКВыплатеОстатки.ПериодВзаиморасчетов,
	|	ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток,
	|	ЗарплатаКВыплатеОстатки.СтатьяФинансирования,
	|	ЗарплатаКВыплатеОстатки.СтатьяРасходов,
	|	ЗарплатаКВыплатеОстатки.ВидДоходаИсполнительногоПроизводства,
	|	ЗарплатаКВыплатеОстатки.ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо
	|АВТОУПОРЯДОЧИВАНИЕ";
	
    //АС_ 2022-01-29
	Если ОтбиратьПоСтатьямРасходов Тогда
		Запрос.УстановитьПараметр("СтатьиРасходов",				СтатьиРасходов);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Орг","Организация = &Орг И СтатьяРасходов В (&СтатьиРасходов)");
	КонецЕсли;
		
	Если ОтбиратьПоСтатьямФинансирования Тогда
		Запрос.УстановитьПараметр("СтатьиФинансирования",				СтатьиФинансирования);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Орг","Организация = &Орг И СтатьяФинансирования В (&СтатьиФинансирования)");
	КонецЕсли;
	//***

	ФизлицаСПометками = ФизлицаСПометками();
	Если НЕ ФизлицаСПометками.Количество() = 0 Тогда
		Запрос.УстановитьПараметр("Физлица",				ФизлицаСПометками);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Орг","Организация = &Орг И ФизическоеЛицо В (&Физлица)");
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = НаборТекущегоОбъекта2.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка);
		НоваяЗапись.Активность  = Истина;
		НоваяЗапись.Период   = Дата;
		НоваяЗапись.Организация = Орг;
		НоваяЗапись.СуммаКВыплате = - Выборка.СуммаКВыплатеОстаток;
		
		//НоваяЗапись.Сотрудник  = Выборка.Сотрудник;
		//НоваяЗапись.Подразделение  = Выборка.Подразделение;
		//НоваяЗапись.ПериодВзаиморасчетов  = Выборка.ПериодВзаиморасчетов;
		//НоваяЗапись.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		//НоваяЗапись.СтатьяФинансирования = Выборка.СтатьяФинансирования;
		//НоваяЗапись.СтатьяРасходов = Выборка.СтатьяРасходов;
		
	КонецЦикла;
	Док.Записать();

КонецПроцедуры

Процедура ЗакрытьВзаиморасчеты(Орг,Док) 
	Дата = Док.ПериодРегистрации;

	Если Док.ТаблицаРегистров.Найти("ВзаиморасчетыССотрудниками", "Имя") = Неопределено Тогда
		НоваяСтрока = Док.ТаблицаРегистров.Добавить();
		НоваяСтрока.Имя = "ВзаиморасчетыССотрудниками";
		//НоваяСтрока.Представление = "Взаиморасчеты с сотрудниками";
		
		Док.ТаблицаРегистров.Сортировать("Имя ВОЗР");
	КонецЕсли;
	
	НаборТекущегоОбъекта = Док.Движения["ВзаиморасчетыССотрудниками"];
	НаборТекущегоОбъекта.Очистить();
	Док.Записать();
	
	Запрос2 = Новый Запрос();
	
	Запрос2.УстановитьПараметр("Дата",				КонецМесяца(Дата) + 1);
	Запрос2.УстановитьПараметр("Орг",				Орг);

	Запрос2.Текст =
	"ВЫБРАТЬ
	|	ВзаиморасчетыССотрудникамиОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВзаиморасчетыССотрудникамиОстатки.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ВзаиморасчетыССотрудникамиОстатки.СтатьяРасходов КАК СтатьяРасходов,
	|	ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВзаиморасчетыССотрудникамиОстатки.Подразделение КАК Подразделение,
	|	ВзаиморасчетыССотрудникамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(&Дата, Организация = &Орг) КАК ВзаиморасчетыССотрудникамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыССотрудникамиОстатки.СтатьяФинансирования,
	|	ВзаиморасчетыССотрудникамиОстатки.ФизическоеЛицо,
	|	ВзаиморасчетыССотрудникамиОстатки.СтатьяРасходов,
	|	ВзаиморасчетыССотрудникамиОстатки.Сотрудник,
	|	ВзаиморасчетыССотрудникамиОстатки.Подразделение,
	|	ВзаиморасчетыССотрудникамиОстатки.СуммаВзаиморасчетовОстаток
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо
	|АВТОУПОРЯДОЧИВАНИЕ";
	
    //АС_ 2022-01-29
	Если ОтбиратьПоСтатьямРасходов Тогда
		Запрос2.УстановитьПараметр("СтатьиРасходов",				СтатьиРасходов);
		Запрос2.Текст = СтрЗаменить(Запрос2.Текст, "Организация = &Орг","Организация = &Орг И СтатьяРасходов В (&СтатьиРасходов)");
	КонецЕсли;
		
	Если ОтбиратьПоСтатьямФинансирования Тогда
		Запрос2.УстановитьПараметр("СтатьиФинансирования",				СтатьиФинансирования);
		Запрос2.Текст = СтрЗаменить(Запрос2.Текст, "Организация = &Орг","Организация = &Орг И СтатьяФинансирования В (&СтатьиФинансирования)");
	КонецЕсли;
	//***

	ФизлицаСПометками = ФизлицаСПометками();
	Если НЕ ФизлицаСПометками.Количество() = 0 Тогда
		Запрос2.УстановитьПараметр("Физлица",				ФизлицаСПометками);
		Запрос2.Текст = СтрЗаменить(Запрос2.Текст, "Организация = &Орг","Организация = &Орг И ФизическоеЛицо В (&Физлица)");
	КонецЕсли;
		
	Выборка2 = Запрос2.Выполнить().Выбрать();	
	
	Пока Выборка2.Следующий() Цикл
		
		НоваяЗапись = НаборТекущегоОбъекта.Добавить();
		НоваяЗапись.Активность  = Истина;
		НоваяЗапись.Сотрудник  = Выборка2.Сотрудник;
		НоваяЗапись.Подразделение  = Выборка2.Подразделение;
		НоваяЗапись.Период   = Дата;
		НоваяЗапись.ФизическоеЛицо = Выборка2.ФизическоеЛицо;
		НоваяЗапись.СуммаВзаиморасчетов = - Выборка2.СуммаВзаиморасчетовОстаток;
		НоваяЗапись.Организация = Орг;
		НоваяЗапись.СтатьяФинансирования = Выборка2.СтатьяФинансирования;
		НоваяЗапись.СтатьяРасходов = Выборка2.СтатьяРасходов;
		
	КонецЦикла;
	
	Док.Записать();
	
	//Если Объект.СкопироватьВзаиморасчетыВБухгалтерскиеВзаиморасчеты Тогда
	//	Если Док.ТаблицаРегистров.Найти("БухгалтерскиеВзаиморасчетыССотрудниками", "Имя") = Неопределено Тогда
	//		НоваяСтрока = Док.ТаблицаРегистров.Добавить();
	//		НоваяСтрока.Имя = "БухгалтерскиеВзаиморасчетыССотрудниками";
	//		
	//		Док.ТаблицаРегистров.Сортировать("Имя ВОЗР");
	//	КонецЕсли;

	//	НаборТекущегоОбъекта = Док.Движения["ВзаиморасчетыССотрудниками"];
	//	НаборТекущегоОбъекта.Прочитать();
	//	НаборТекущегоОбъекта2 = Док.Движения["БухгалтерскиеВзаиморасчетыССотрудниками"];
	//	НаборТекущегоОбъекта2.Прочитать();
	//	НаборТекущегоОбъекта2.Очистить();
	//	Для Каждого Движение Из НаборТекущегоОбъекта Цикл
	//		НоваяЗапись = НаборТекущегоОбъекта2.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяЗапись,Движение);
	//	КонецЦикла;
	//	Док.Записать();
	// КонецЕсли;


	

КонецПроцедуры

Процедура ЗакрытьБухгалтерискиеВзаиморасчеты(Орг,Док, КопировитьИзВзаиморасчетов = Ложь) 
	Дата = Док.ПериодРегистрации;

	Если Док.ТаблицаРегистров.Найти("БухгалтерскиеВзаиморасчетыССотрудниками", "Имя") = Неопределено Тогда
		НоваяСтрока = Док.ТаблицаРегистров.Добавить();
		НоваяСтрока.Имя = "БухгалтерскиеВзаиморасчетыССотрудниками";
		//НоваяСтрока.Представление = "Взаиморасчеты с сотрудниками";
		
		Док.ТаблицаРегистров.Сортировать("Имя ВОЗР");
	КонецЕсли;
	
	НаборТекущегоОбъекта = Док.Движения["БухгалтерскиеВзаиморасчетыССотрудниками"];
	НаборТекущегоОбъекта.Очистить();
	Док.Записать();
	
	Если КопировитьИзВзаиморасчетов Тогда

		НаборТекущегоОбъекта0 = Док.Движения["ВзаиморасчетыССотрудниками"];
		НаборТекущегоОбъекта0.Прочитать();
		Для Каждого Движение Из НаборТекущегоОбъекта0 Цикл
			НоваяЗапись = НаборТекущегоОбъекта.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,Движение);
		КонецЦикла;
		Док.Записать();
		Возврат;
	КонецЕсли;
	
	Запрос2 = Новый Запрос();
	
	Запрос2.УстановитьПараметр("Дата",				КонецМесяца(Дата) + 1);
	Запрос2.УстановитьПараметр("Орг",				Орг);

	Запрос2.Текст =
	"ВЫБРАТЬ
	|	БухгалтерскиеВзаиморасчетыССотрудникамиОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	БухгалтерскиеВзаиморасчетыССотрудникамиОстатки.СтатьяФинансирования КАК СтатьяФинансирования,
	|	БухгалтерскиеВзаиморасчетыССотрудникамиОстатки.СтатьяРасходов КАК СтатьяРасходов,
	|	БухгалтерскиеВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	БухгалтерскиеВзаиморасчетыССотрудникамиОстатки.Подразделение КАК Подразделение,
	|	БухгалтерскиеВзаиморасчетыССотрудникамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток
	|ИЗ
	|	РегистрНакопления.БухгалтерскиеВзаиморасчетыССотрудниками.Остатки(&Дата, Организация = &Орг) КАК БухгалтерскиеВзаиморасчетыССотрудникамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	БухгалтерскиеВзаиморасчетыССотрудникамиОстатки.СтатьяФинансирования,
	|	БухгалтерскиеВзаиморасчетыССотрудникамиОстатки.ФизическоеЛицо,
	|	БухгалтерскиеВзаиморасчетыССотрудникамиОстатки.СтатьяРасходов,
	|	БухгалтерскиеВзаиморасчетыССотрудникамиОстатки.Сотрудник,
	|	БухгалтерскиеВзаиморасчетыССотрудникамиОстатки.Подразделение,
	|	БухгалтерскиеВзаиморасчетыССотрудникамиОстатки.СуммаВзаиморасчетовОстаток
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо
	|АВТОУПОРЯДОЧИВАНИЕ";
	
    //АС_ 2022-01-29
	Если ОтбиратьПоСтатьямРасходов Тогда
		Запрос2.УстановитьПараметр("СтатьиРасходов",				СтатьиРасходов);
		Запрос2.Текст = СтрЗаменить(Запрос2.Текст, "Организация = &Орг","Организация = &Орг И СтатьяРасходов В (&СтатьиРасходов)");
	КонецЕсли;
		
	Если ОтбиратьПоСтатьямФинансирования Тогда
		Запрос2.УстановитьПараметр("СтатьиФинансирования",				СтатьиФинансирования);
		Запрос2.Текст = СтрЗаменить(Запрос2.Текст, "Организация = &Орг","Организация = &Орг И СтатьяФинансирования В (&СтатьиФинансирования)");
	КонецЕсли;
	//***

	ФизлицаСПометками = ФизлицаСПометками();
	Если НЕ ФизлицаСПометками.Количество() = 0 Тогда
		Запрос2.УстановитьПараметр("Физлица",				ФизлицаСПометками);
		Запрос2.Текст = СтрЗаменить(Запрос2.Текст, "Организация = &Орг","Организация = &Орг И ФизическоеЛицо В (&Физлица)");
	КонецЕсли;
		
	Выборка2 = Запрос2.Выполнить().Выбрать();	
	
	Пока Выборка2.Следующий() Цикл
		
		НоваяЗапись = НаборТекущегоОбъекта.Добавить();
		НоваяЗапись.Активность  = Истина;
		НоваяЗапись.Сотрудник  = Выборка2.Сотрудник;
		НоваяЗапись.Подразделение  = Выборка2.Подразделение;
		НоваяЗапись.Период   = Дата;
		НоваяЗапись.ФизическоеЛицо = Выборка2.ФизическоеЛицо;
		НоваяЗапись.СуммаВзаиморасчетов = - Выборка2.СуммаВзаиморасчетовОстаток;
		НоваяЗапись.Организация = Орг;
		НоваяЗапись.СтатьяФинансирования = Выборка2.СтатьяФинансирования;
		НоваяЗапись.СтатьяРасходов = Выборка2.СтатьяРасходов;
		
	КонецЦикла; 
	Док.Записать();

КонецПроцедуры

Процедура ЗакрытьРасчетыНалоговыхАгентовСБюджетомПоНДФЛ(Орг,Док) 
	Дата = Док.ПериодРегистрации;

	Если Док.ТаблицаРегистров.Найти("РасчетыНалоговыхАгентовСБюджетомПоНДФЛ", "Имя") = Неопределено Тогда
		НоваяСтрока = Док.ТаблицаРегистров.Добавить();
		НоваяСтрока.Имя = "РасчетыНалоговыхАгентовСБюджетомПоНДФЛ";
		//НоваяСтрока.Представление = "Взаиморасчеты с сотрудниками";
		
		Док.ТаблицаРегистров.Сортировать("Имя ВОЗР");
	КонецЕсли;
	
	НаборТекущегоОбъекта = Док.Движения["РасчетыНалоговыхАгентовСБюджетомПоНДФЛ"];
	НаборТекущегоОбъекта.Очистить();
	Док.Записать();
	
	Если Ложь Тогда
		Запрос3 = Новый Запрос();
		
		Запрос3.УстановитьПараметр("Дата",				КонецМесяца(Дата) + 1);
		Запрос3.УстановитьПараметр("Орг",				Орг);

		Запрос3.Текст =
		"ВЫБРАТЬ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.Организация КАК Организация,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.Ставка КАК Ставка,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.ИсчисленоПоДивидендам КАК ИсчисленоПоДивидендам,
		|	СУММА(РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Остатки(&Дата, Организация = &Орг) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.РегистрацияВНалоговомОргане,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.МесяцНалоговогоПериода,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.Ставка,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.Организация,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.ФизическоеЛицо,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.ВключатьВДекларациюПоНалогуНаПрибыль,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.ИсчисленоПоДивидендам
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	    //АС_ 2022-01-29
		Если ОтбиратьПоСтатьямРасходов Тогда
			Запрос3.УстановитьПараметр("СтатьиРасходов",				СтатьиРасходов);
			Запрос3.Текст = СтрЗаменить(Запрос3.Текст, "Организация = &Орг","Организация = &Орг И СтатьяРасходов В (&СтатьиРасходов)");
		КонецЕсли;
			
		Если ОтбиратьПоСтатьямФинансирования Тогда
			Запрос3.УстановитьПараметр("СтатьиФинансирования",				СтатьиФинансирования);
			Запрос3.Текст = СтрЗаменить(Запрос3.Текст, "Организация = &Орг","Организация = &Орг И СтатьяФинансирования В (&СтатьиФинансирования)");
		КонецЕсли;
		//***

		ФизлицаСПометками = ФизлицаСПометками();
		Если НЕ ФизлицаСПометками.Количество() = 0 Тогда
			Запрос3.УстановитьПараметр("Физлица",				ФизлицаСПометками);
			Запрос3.Текст = СтрЗаменить(Запрос3.Текст, "Организация = &Орг","Организация = &Орг И ФизическоеЛицо В (&Физлица)");
		КонецЕсли;
			
		Выборка3 = Запрос3.Выполнить().Выбрать();	
		
		Пока Выборка3.Следующий() Цикл
			
			НоваяЗапись = НаборТекущегоОбъекта.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка3);
			НоваяЗапись.Активность  = Истина;
			НоваяЗапись.ВидДвижения  = ВидДвиженияНакопления.Расход;
			НоваяЗапись.Период   = Дата;
			НоваяЗапись.Организация = Орг;
			НоваяЗапись.Сумма = Выборка3.СуммаОстаток;
			
		КонецЦикла;
	Иначе

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период КАК Период,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор КАК Регистратор,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Активность КАК Активность,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения КАК ВидДвижения,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
		|	МАКСИМУМ(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода) КАК МесяцНалоговогоПериода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация КАК Организация,
		|	СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) КАК Сумма,
		|	СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов) КАК НалогНаПрибыльДляДивидендов,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СрокПеречисления КАК СрокПеречисления,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сторно КАК Сторно
		|ПОМЕСТИТЬ втРасчетыСНалогопл
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор = &Регистратор
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сторно,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СрокПеречисления,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Активность,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРасчетыСНалогопл.Период КАК Период,
		|	втРасчетыСНалогопл.Регистратор КАК Регистратор,
		|	втРасчетыСНалогопл.Активность КАК Активность,
		|	втРасчетыСНалогопл.ВидДвижения КАК ВидДвижения,
		|	втРасчетыСНалогопл.ФизическоеЛицо КАК ФизическоеЛицо,
		|	втРасчетыСНалогопл.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
		|	втРасчетыСНалогопл.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	втРасчетыСНалогопл.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	втРасчетыСНалогопл.Организация КАК Организация,
		|	втРасчетыСНалогопл.Сумма КАК Сумма,
		|	втРасчетыСНалогопл.НалогНаПрибыльДляДивидендов КАК НалогНаПрибыльДляДивидендов,
		|	втРасчетыСНалогопл.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
		|	втРасчетыСНалогопл.СрокПеречисления КАК СрокПеречисления,
		|	втРасчетыСНалогопл.Сторно КАК Сторно
		|ИЗ
		|	втРасчетыСНалогопл КАК втРасчетыСНалогопл
		|ГДЕ
		|	втРасчетыСНалогопл.Сумма <> 0
		|ИТОГИ ПО
		|	Регистратор";
		
		Запрос.УстановитьПараметр("Регистратор", Док.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРегистратор.Следующий() Цикл
			Выборка2 = ВыборкаРегистратор.Выбрать();
			Пока Выборка2.Следующий() Цикл
				//		ИндексСтроки = Выборка2[ИмяКолонкиНомераСтроки] - 1;
				//		ДвижениеРегистра = НаборДвижений[ИндексСтроки];
				ДатаВыплатыДляНДФЛ = Выборка2.Период;
				
				НоваяЗапись2 = НаборТекущегоОбъекта.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись2,Выборка2);
				//		НоваяЗапись2.Активность  = Истина;
				НоваяЗапись2.ВидДвижения  = ВидДвиженияНакопления.Приход;
				//		НоваяЗапись2.Период   = ДатаВыплатыДляНДФЛ;
				//		НоваяЗапись2.Организация = Орг;
				//		НоваяЗапись2.Сумма = Выборка3.СуммаОстаток;
				НоваяЗапись2.Ставка = Перечисления.НДФЛСтавки.Ставка13;
				
				НоваяЗапись2 = НаборТекущегоОбъекта.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись2,Выборка2);
				//		НоваяЗапись2.Активность  = Истина;
				НоваяЗапись2.ВидДвижения  = ВидДвиженияНакопления.Расход;
				//		НоваяЗапись2.Период   = ДатаВыплатыДляНДФЛ;
				//		НоваяЗапись2.Организация = Орг;
				//		НоваяЗапись2.Сумма = Выборка3.СуммаОстаток;
				НоваяЗапись2.Ставка = Перечисления.НДФЛСтавки.Ставка13;
				НоваяЗапись2.КрайнийСрокУплаты   = ДобавитьМесяц(Дата(Год(ДатаВыплатыДляНДФЛ),Месяц(ДатаВыплатыДляНДФЛ),28),?(День(ДатаВыплатыДляНДФЛ)<23,0,1));
				Сообщить(НоваяЗапись2.КрайнийСрокУплаты);
				
				// Обработка строки
				
			КонецЦикла;
			Сообщить("ЫЫ1");
			//НаборДвижений.ОбменДанными.Загрузка = Истина;
			//НаборТекущегоОбъекта.Записать();
			Сообщить("ЫЫ2");
		КонецЦикла;
		Сообщить("ЫЫ3");
	КонецЕсли;
	Док.Записать();

КонецПроцедуры

//АС_ 2019-11-28
Процедура ЗакрытьРасчетыНалогоплательщиковСБюджетомПоНДФЛ(Орг,Док) 
	Дата = Док.ПериодРегистрации;

	Если Док.ТаблицаРегистров.Найти("РасчетыНалогоплательщиковСБюджетомПоНДФЛ", "Имя") = Неопределено Тогда
		НоваяСтрока = Док.ТаблицаРегистров.Добавить();
		НоваяСтрока.Имя = "РасчетыНалогоплательщиковСБюджетомПоНДФЛ";
		//НоваяСтрока.Представление = "Взаиморасчеты с сотрудниками";
		
		//НоваяСтрока = Док.ТаблицаРегистров.Добавить();
		//НоваяСтрока.Имя = "РасчетыНалоговыхАгентовСБюджетомПоНДФЛ";

		Док.ТаблицаРегистров.Сортировать("Имя ВОЗР");
	КонецЕсли;
	
	НаборТекущегоОбъекта = Док.Движения["РасчетыНалогоплательщиковСБюджетомПоНДФЛ"];
	НаборТекущегоОбъекта.Очистить();

	//НаборТекущегоОбъекта2 = Док.Движения["РасчетыНалоговыхАгентовСБюджетомПоНДФЛ"];
	//НаборТекущегоОбъекта2.Очистить();

	Док.Записать();
	
	Запрос3 = Новый Запрос();
	
	//Запрос3.УстановитьПараметр("Дата",				КонецМесяца(Дата) + 1);
	Запрос3.УстановитьПараметр("ДатаВыплатыДляНДФЛ",	ДатаВыплатыДляНДФЛ);
	Запрос3.УстановитьПараметр("Орг",					Орг);
	Запрос3.УстановитьПараметр("Расход",				ВидДвиженияНакопления.Расход);

	Запрос3.Текст =
	//"ВЫБРАТЬ
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация КАК Организация,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода КАК КатегорияДохода,
	//|	СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаОстаток) КАК СуммаОстаток,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КодДохода КАК КодДохода,
	//|	СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияОстаток) КАК СуммаСПревышенияОстаток,
	//|	СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендовОстаток) КАК НалогНаПрибыльДляДивидендовОстаток,
	//|	ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано) КАК ВариантУдержания,
	//|	ЗНАЧЕНИЕ(Перечисление.СрокиПеречисляемогоНалога.ПрочиеДоходы) КАК СрокПеречисления
	//|ИЗ
	//|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Остатки(&Дата, Организация = &Орг) КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода,
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КодДохода
	//|АВТОУПОРЯДОЧИВАНИЕ";
	"ВЫБРАТЬ
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация КАК Организация,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода КАК КатегорияДохода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КодДохода КАК КодДохода,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано) КАК ВариантУдержания,
	|	ЗНАЧЕНИЕ(Перечисление.СрокиПеречисляемогоНалога.ПрочиеДоходы) КАК СрокПеречисления,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование КАК ДокументОснование,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = &Расход
	|				ТОГДА -РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма
	|			ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма
	|		КОНЕЦ) КАК СуммаОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = &Расход
	|				ТОГДА -РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
	|			ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
	|		КОНЕЦ) КАК СуммаСПревышенияОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
	|ГДЕ
	//|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода < &Дата
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода <= &ДатаВыплатыДляНДФЛ
	|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация = &Орг
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КодДохода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование
	|АВТОУПОРЯДОЧИВАНИЕ";
	
    //АС_ 2022-01-29
	Если ОтбиратьПоСтатьямРасходов Тогда
		Запрос3.УстановитьПараметр("СтатьиРасходов",				СтатьиРасходов);
		Запрос3.Текст = СтрЗаменить(Запрос3.Текст, "Организация = &Орг","Организация = &Орг И СтатьяРасходов В (&СтатьиРасходов)");
	КонецЕсли;
		
	Если ОтбиратьПоСтатьямФинансирования Тогда
		Запрос3.УстановитьПараметр("СтатьиФинансирования",				СтатьиФинансирования);
		Запрос3.Текст = СтрЗаменить(Запрос3.Текст, "Организация = &Орг","Организация = &Орг И СтатьяФинансирования В (&СтатьиФинансирования)");
	КонецЕсли;
	//***

	ФизлицаСПометками = ФизлицаСПометками();
	Если НЕ ФизлицаСПометками.Количество() = 0 Тогда
		Запрос3.УстановитьПараметр("Физлица",				ФизлицаСПометками);
		Запрос3.Текст = СтрЗаменить(Запрос3.Текст, "Организация = &Орг","Организация = &Орг И ФизическоеЛицо В (&Физлица)");
	КонецЕсли;
		
	Выборка3 = Запрос3.Выполнить().Выбрать();	
	
	Пока Выборка3.Следующий() Цикл
		Если Выборка3.СуммаОстаток = 0 И Выборка3.СуммаСПревышенияОстаток = 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяЗапись = НаборТекущегоОбъекта.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка3);
		НоваяЗапись.Активность  = Истина;
		НоваяЗапись.ВидДвижения  = ВидДвиженияНакопления.Расход;
		НоваяЗапись.Период   = ДатаВыплатыДляНДФЛ;
		НоваяЗапись.Организация = Орг;
		НоваяЗапись.Сумма = Выборка3.СуммаОстаток;
		НоваяЗапись.СуммаСПревышения = Выборка3.СуммаСПревышенияОстаток;
		
		//НоваяЗапись2 = НаборТекущегоОбъекта2.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяЗапись2,Выборка3);
		//НоваяЗапись2.Активность  = Истина;
		//НоваяЗапись2.ВидДвижения  = ВидДвиженияНакопления.Приход;
		//НоваяЗапись2.Период   = ДатаВыплатыДляНДФЛ;
		//НоваяЗапись2.Организация = Орг;
		//НоваяЗапись2.Сумма = Выборка3.СуммаОстаток;
		//НоваяЗапись2.Ставка = Перечисления.НДФЛСтавки.Ставка13;
		//
		//НоваяЗапись2 = НаборТекущегоОбъекта2.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяЗапись2,Выборка3);
		//НоваяЗапись2.Активность  = Истина;
		//НоваяЗапись2.ВидДвижения  = ВидДвиженияНакопления.Расход;
		//НоваяЗапись2.Период   = ДатаВыплатыДляНДФЛ;
		//НоваяЗапись2.Организация = Орг;
		//НоваяЗапись2.Сумма = Выборка3.СуммаОстаток;
		//НоваяЗапись2.Ставка = Перечисления.НДФЛСтавки.Ставка13;
		//НоваяЗапись2.КрайнийСрокУплаты   = ДобавитьМесяц(Дата(Год(ДатаВыплатыДляНДФЛ),Месяц(ДатаВыплатыДляНДФЛ),28),?(День(ДатаВыплатыДляНДФЛ)<23,0,1));
		
		//НоваяЗапись3 = НаборТекущегоОбъекта3.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяЗапись3,Выборка3);
		//НоваяЗапись3.Активность  = Истина;
		//НоваяЗапись3.ВидДвижения  = ВидДвиженияНакопления.Расход;
		//НоваяЗапись3.Период   = Дата;
		//НоваяЗапись3.Организация = Орг;
		//НоваяЗапись3.Сумма = Выборка3.СуммаОстаток;
		//НоваяЗапись3.Ставка = Перечисления.НДФЛСтавки.Ставка13;
		
	КонецЦикла;
	
	Док.Записать();

КонецПроцедуры

Функция ФизлицаСПометками();
	ФизлицаСПометками = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из Физлица Цикл
		Если ЭлементСписка.Пометка Тогда
			ФизлицаСПометками.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	Возврат ФизлицаСПометками
КонецФункции

&НаСервере
Процедура ДокументПриИзмененииНаСервере()
	Объект.Организация = Объект.Документ.Организация;
КонецПроцедуры


&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	ДокументПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьВсемиОрганизациямиНаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПереносДанных.Ссылка КАК Ссылка,
		|	ПереносДанных.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ПереносыДанных
		|ИЗ
		|	Документ.ПереносДанных КАК ПереносДанных
		|ГДЕ
		|	НЕ ПереносДанных.ПометкаУдаления
		|	И ПереносДанных.ПериодРегистрации = &ПериодРегистрации
		|	И ПереносДанных.Номер ПОДОБНО ""ЗакрОст"" + ""%""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Организации.Ссылка КАК Организация,
		|	СУММА(1) КАК Счетчик
		|ПОМЕСТИТЬ ВТ_Выборка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПереносыДанных КАК ВТ_ПереносыДанных
		|		ПО Организации.Ссылка = ВТ_ПереносыДанных.Организация
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Организации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_Выборка.Счетчик > 1
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Выполнить,
		|	ВТ_Выборка.Организация КАК Организация,
		|	ВТ_ПереносыДанных.Ссылка КАК Документ,
		|	ВТ_Выборка.Счетчик КАК Счетчик
		|ИЗ
		|	ВТ_Выборка КАК ВТ_Выборка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПереносыДанных КАК ВТ_ПереносыДанных
		|		ПО ВТ_Выборка.Организация = ВТ_ПереносыДанных.Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", Объект.ПериодРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	Организации.Загрузить(РезультатЗапроса.Выгрузить());
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьВсемиОрганизациями(Команда)
	ЗаполнитьВсемиОрганизациямиНаСервере();
КонецПроцедуры


#Область ОбработчикиСобытийИзмененияПериодаГлавная

&НаСервере
Процедура МесяцНачисленияПриИзмененииНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиПользователя", "ПериодРегистрации", Объект.ПериодРегистрации);
	//КонДата = КонецМесяца(ПериодРегистрации);
	//УстановитьОтборСписков();
	
КонецПроцедуры


&НаКлиенте
Процедура МесяцНачисленияСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцНачисленияСтрокой");
	
	МесяцНачисленияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачисленияСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("МесяцНачисленияСтрокойНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ПериодРегистрации", "МесяцНачисленияСтрокой", Ложь, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачисленияСтрокойНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт

	МесяцНачисленияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачисленияСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцНачисленияСтрокой", Направление);
	ПодключитьОбработчикОжидания("УстановитьОтборСписковПослеИзмененияОтбора", 0.5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСписковПослеИзмененияОтбора()
	МесяцНачисленияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачисленияСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачисленияСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВзаиморасчетыВБухгалтерскиеВзаиморасчетыПриИзменении(Элемент)
	Если Объект.СкопироватьВзаиморасчетыВБухгалтерскиеВзаиморасчеты Тогда
		Объект.ЗакрыватьБухгалтерскиеВзаиморасчетыССотрудниками = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрыватьБухгалтерскиеВзаиморасчетыССотрудникамиПриИзменении(Элемент)
	Если Объект.ЗакрыватьБухгалтерскиеВзаиморасчетыССотрудниками Тогда
		Объект.СкопироватьВзаиморасчетыВБухгалтерскиеВзаиморасчеты = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФизЛицИзТабДокНаСервере()
	КолСтр = ФЛ.ВысотаТаблицы;
	Для Стр = 1 По КолСтр Цикл
		Отбор = Новый Структура();
		ФЛстр = СокрЛП(ФЛ.ПолучитьОбласть("R" + Стр + "C" + 1).ТекущаяОбласть.Текст);

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизическиеЛица.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	ФизическиеЛица.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ФЛстр);
		ВыборкаФЛ = Запрос.Выполнить().Выбрать();

		//Отбор.Вставить("Наименование", ФЛстр);
		//ВыборкаФЛ = Справочники.ФизическиеЛица.Выбрать(,,Отбор);
		Если ВыборкаФЛ.Количество()=0 Тогда
			Сообщить("Не найдено физическое лицо: "+ФЛстр);
	    	НовСтр = Физлица.Добавить();
		ИначеЕсли ВыборкаФЛ.Количество()=1 Тогда
			ВыборкаФЛ.Следующий();
	    	НовСтр = Физлица.Добавить();
			НовСтр.Значение = ВыборкаФЛ.Ссылка;
			НовСтр.Пометка = Истина;
		Иначе
			Сообщить("Найдено несколько физических лиц: "+ФЛстр);
			Пока ВыборкаФЛ.Следующий() Цикл
		    	НовСтр = Физлица.Добавить();
				НовСтр.Значение = ВыборкаФЛ.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФизЛицИзТабДок(Команда)
	ЗаполнитьФизЛицИзТабДокНаСервере();
КонецПроцедуры


#КонецОбласти

