
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	////Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	////Параметры.УстановитьЗначениеПараметра("ВалютаUSD", Справочники.Валюты.НайтиПоКоду("USD"));  
	//
	//
	////Данный код установит значение параметра, но при заполнении отчета переданными настройками значение параметра 
	////не отобразится на форме и реквизит будет пустым.
	//
	//ИмяПараметра  = "ВалютаUSD";	
	//
	//ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	//ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	//ПараметрСКД.Значение =  Справочники.Валюты.НайтиПоКоду("USD");
	//ПараметрСКД.Использование = Истина;
	//
	////Для того, чтобы пользователь видел значение параметра на форме нужно добавить следующую конструкцию:
	//	
	//	Если ЗначениеЗаполнено(ПараметрСКД.ИдентификаторПользовательскойНастройки) Тогда
	//		
	//		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
	//		ПараметрСКД.ИдентификаторПользовательскойНастройки);
	//		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//			ПользовательскийПараметр.Значение = ПараметрСКД.Значение;
	//		КонецЕсли;
	//		
	//	КонецЕсли;    
		
	КонецПроцедуры
