 
//++
Функция СоздатьИсходящееПисьмо(Параметры) Экспорт
	
	// 1. Обязательные параметры письма
	Тема = Параметры.Тема;
	Текст = "";
	ТекстHTML = "";
	УчетнаяЗапись = Параметры.УчетнаяЗапись;
	
	ПолучателиПисьма = Новый Массив;
	Если ТипЗнч(Параметры.ПолучателиПисьма) = Тип("Строка") Тогда
		ПолучателиПисьма.Добавить(Параметры.ПолучателиПисьма);
	Иначе
		Для Каждого Получатель Из Параметры.ПолучателиПисьма Цикл
			ПолучателиПисьма.Добавить(Получатель);
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("Текст") Тогда
		Текст = Параметры.Текст;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекстHTML") Тогда
		ТекстHTML = Параметры.ТекстHTML;
	КонецЕсли;
	
	// 2. НЕобязательные параметры письма
	Важность = Перечисления.ВариантыВажностиВзаимодействия.Обычная;
	Если Параметры.Свойство("Важность") Тогда
		Если ТипЗнч(Параметры.Важность) = Тип("Строка") Тогда
			Важность = Перечисления.ВариантыВажностиВзаимодействия[Параметры.Важность];
		Иначе
			Важность = Параметры.Важность;
		КонецЕсли;
	КонецЕсли;
	
	ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
	Если Параметры.Свойство("ТипТекста") Тогда
		Если ТипЗнч(Параметры.ТипТекста) = Тип("Строка") Тогда
			ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем[Параметры.ТипТекста];
		Иначе
			ТипТекста = Параметры.ТипТекста;
		КонецЕсли;
	КонецЕсли;
	
	ПолучателиКопий = Новый Массив;
	Если Параметры.Свойство("ПолучателиКопий") Тогда
		Если ТипЗнч(Параметры.ПолучателиКопий) = Тип("Строка") Тогда
			ПолучателиКопий.Добавить(Параметры.ПолучателиКопий);
		Иначе
			Для Каждого Получатель Из Параметры.ПолучателиКопий Цикл
				ПолучателиКопий.Добавить(Получатель);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ПолучателиСкрытыхКопий = Новый Массив;
	Если Параметры.Свойство("ПолучателиСкрытыхКопий") Тогда
		Если ТипЗнч(Параметры.ПолучателиСкрытыхКопий) = Тип("Строка") Тогда
			ПолучателиСкрытыхКопий.Добавить(Параметры.ПолучателиСкрытыхКопий);
		Иначе
			Для Каждого Получатель Из Параметры.ПолучателиСкрытыхКопий Цикл
				ПолучателиСкрытыхКопий.Добавить(Получатель);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты  Тогда
		ПолучателиСкрытыхКопий.Добавить("rinat.galimov@phoenixtrading.ltd"); // требование УК
	КонецЕсли;
	
	// Вложение - тип Структура
	// Вложение.Данные - ДвоичныеДанные вложения
	// Вложение.ИмяФайла - имя файла с расширением без полного пути
	// Вложение.МассивПодписей (необяз) - подписи файла вложения
	Вложения = Неопределено; // массив структур Вложение
	Параметры.Свойство("Вложения", Вложения);
	
	ДокументОбъект = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокументОбъект.Важность = Важность;
	ДокументОбъект.СтатусПисьма = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
	ДокументОбъект.ТипТекста = ТипТекста;
	
	ДокументОбъект.Тема  = Тема;
	ДокументОбъект.Текст = Текст;
	ДокументОбъект.ТекстHTML = ТекстHTML;
	
	ДокументОбъект.УчетнаяЗапись = УчетнаяЗапись;
	ДокументОбъект.ОтправительПредставление = ДокументОбъект.УчетнаяЗапись;
	ДокументОбъект.ЕстьВложения = НЕ Вложения = Неопределено;
	
	Для Каждого ПолучательПисьма Из ПолучателиПисьма Цикл
		НоваяСтрока = ДокументОбъект.ПолучателиПисьма.Добавить();
		НоваяСтрока.Адрес = ПолучательПисьма;
	КонецЦикла;
		
	Для Каждого ПолучательКопий Из ПолучателиКопий Цикл
		НоваяСтрока = ДокументОбъект.ПолучателиКопий.Добавить();
		НоваяСтрока.Адрес = ПолучательКопий;
	КонецЦикла;
			
	Для Каждого ПолучательСкрытыхКопий Из ПолучателиСкрытыхКопий Цикл
		НоваяСтрока = ДокументОбъект.ПолучателиСкрытыхКопий.Добавить();
		НоваяСтрока.Адрес = ПолучательСкрытыхКопий;
	КонецЦикла;
			
	НачатьТранзакцию(); // чтобы письмо не улетело пустым без вложений (если они есть)
	
	ДокументОбъект.СформироватьПредставленияКонтактов2();//(ПолучателиПисьма, ПолучателиКопий, ПолучателиСкрытыхКопий);  
	ДокументОбъект.ДополнительныеСвойства.Вставить("НеЗаписыватьКонтакты", Истина);
	ДокументОбъект.Записать();
	
	ЭлектронноеПисьмоИсходящее = ДокументОбъект.Ссылка;
	
	Если НЕ Вложения = Неопределено Тогда
		
		КоличествоПустыхИменВоВложениях = 0;
		
		Для Каждого Вложение Из Вложения Цикл
			
			// Вложение - тип Структура
			// Вложение.Данные - ДвоичныеДанные вложения
			// Вложение.ИмяФайла - имя файла с расширением без полного пути
			// Вложение.МассивПодписей (необяз) - подписи файла вложения
			
			Вложение.Вставить("Идентификатор", ""); // служебное поле
			
			Если НЕ Вложение.Свойство("МассивПодписей") Тогда
				Вложение.Вставить("МассивПодписей", Новый Массив); 
			КонецЕсли;
			
			ЗаписатьВложениеЭлектронногоПисьма(
						ЭлектронноеПисьмоИсходящее,
						Вложение,
						Вложение.МассивПодписей,
						КоличествоПустыхИменВоВложениях);
						
		КонецЦикла;

	КонецЕсли;	
	
	ЗафиксироватьТранзакцию();
	
	Возврат ЭлектронноеПисьмоИсходящее;

КонецФункции
